<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>macOS Sharing Services settings</string>
	<key>pfm_documentation_url</key>
	<string>https://developer.apple.com/business/documentation/Configuration-Profile-Reference.pdf</string>
	<key>pfm_documentation_reference</key>
	<string>MacOS 10.9 or later only. The ShareKit Payload is designated by specifying com.apple.ShareKitHelper as the PayloadType. It can contain only one payload. It is supported on the User Channel.

The ShareKit Payload specifies which ShareKit plugin can be accessed on client. Both allow and disallow lists can be
specified.

This payload is deprecated as of macOS 10.12. For clients running macOS 10.13 or later, use the NSExtension Payload
instead. If a profile contains both a NSExtension Payload and a ShareKit Payload, the ShareKit Payload will be ignored.</string>
	<key>pfm_domain</key>
	<string>com.apple.ShareKitHelper</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2019-04-03T10:50:49Z</date>
	<key>pfm_macos_deprecated</key>
	<string>10.13</string>
	<key>pfm_macos_min</key>
	<string>10.9</string>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures macOS Sharing Services settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Sharing Services</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ShareKitHelper</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited. Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.ShareKitHelper</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile. The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Optional. List of plugin IDs that will show up in the user's Share menu. If this array exists then only these items will be permitted</string>
			<key>pfm_macos_deprecated</key>
			<string>10.13</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>SHKAllowedShareServices</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Allowed Sharing Service</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.share.AirDrop</string>
						<string>com.apple.share.addtoaperture</string>
						<string>com.apple.share.Facebook</string>
						<string>com.apple.share.LinkedIn.post</string>
						<string>com.apple.share.Mail</string>
						<string>com.apple.share.Messages</string>
						<string>com.apple.Notes.SharingExtension</string>
						<string>com.apple.share.addtoiphoto</string>
						<string>com.apple.share.readlater</string>
						<string>com.apple.reminders.RemindersShareExtension</string>
						<string>com.apple.share.SinaWeibo</string>				
						<string>com.apple.share.Twitter</string>
						<string>com.apple.share.Video</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>AirDrop</string>
						<string>Aperture</string>
						<string>Facebook</string>
						<string>LinkedIn</string>
						<string>Mail</string>
						<string>Messages</string>
						<string>Notes</string>
						<string>Photos</string>
						<string>Reading List</string>
						<string>Reminders</string>
						<string>Sina Weibo</string>
						<string>Twitter</string>
						<string>Video Services</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Allowed Sharing Services</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Denied sharing services.  Cannot be used in addition to the Allowed Sharing Services (SHKAllowedShareServices) array.</string>
			<key>pfm_description_reference</key>
			<string>Optional. List of plugin IDs that will not show up in the user's Share menu. This key is used only if there is no SHKAllowedShareServices key.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<true/>
							<key>pfm_target</key>
							<string>SHKAllowedShareServices</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_macos_deprecated</key>
			<string>10.13</string>
			<key>pfm_macos_min</key>
			<string>10.9</string>
			<key>pfm_name</key>
			<string>SHKDeniedShareServices</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>Denied Sharing Service</string>
					<key>pfm_range_list</key>
					<array>
						<string>com.apple.share.AirDrop</string>
						<string>com.apple.share.addtoaperture</string>
						<string>com.apple.share.Facebook</string>
						<string>com.apple.share.LinkedIn.post</string>
						<string>com.apple.share.Mail</string>
						<string>com.apple.share.Messages</string>
						<string>com.apple.Notes.SharingExtension</string>
						<string>com.apple.share.addtoiphoto</string>
						<string>com.apple.share.readlater</string>
						<string>com.apple.reminders.RemindersShareExtension</string>
						<string>com.apple.share.SinaWeibo</string>				
						<string>com.apple.share.Twitter</string>
						<string>com.apple.share.Video</string>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>AirDrop</string>
						<string>Aperture</string>
						<string>Facebook</string>
						<string>LinkedIn</string>
						<string>Mail</string>
						<string>Messages</string>
						<string>Notes</string>
						<string>Photos</string>
						<string>Reading List</string>
						<string>Reminders</string>
						<string>Sina Weibo</string>
						<string>Twitter</string>
						<string>Video Services</string>
					</array>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Denied Sharing Services</string>
			<key>pfm_type</key>
			<string>array</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>Sharing Services</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
