<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Use this section to define settings for VPN access.</string>
	<key>pfm_documentation_url</key>
	<string>https://help.apple.com/deployment/mdm/#/mdm2d2adb35d</string>
	<key>pfm_domain</key>
	<string>com.apple.vpn.managed</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2019-02-23T20:27:52Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures VPN settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>VPN</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.vpn.managed</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Description of the VPN connection displayed on the device</string>
			<key>pfm_description_reference</key>
			<string>Optional. Description of the VPN connection displayed on the device.</string>
			<key>pfm_name</key>
			<string>UserDefinedName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>User Defined Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>L2TP</string>
			<key>pfm_description</key>
			<string>Determines the settings available for this VPN payload</string>
			<key>pfm_description_reference</key>
			<string>Determines the settings available in the payload for this type of VPN connection. It can have one of the following values:
- L2TP
- PPTP
- IPSec (Cisco)
- IKEv2 (see IKEv2 Dictionary Keys)
- AlwaysOn (see AlwaysOn Dictionary Keys)
- VPN (solution uses a VPN plugin or NetworkExtension, so the VPNSubType key is required (see below).</string>
			<key>pfm_name</key>
			<string>VPNType</string>
			<key>pfm_range_list</key>
			<array>
				<string>L2TP</string>
				<string>PPTP</string>
				<string>IPSec</string>
				<string>VPN</string>
				<string>IKEv2</string>
				<string>AlwaysOn</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>L2TP</string>
				<string>PPTP</string>
				<string>IPSec (Cisco)</string>
				<string>VPN</string>
				<string>IKEv2</string>
				<string>Always On</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>If VPNType is "VPN" this field will be an identifier for a vendor specified configuration dictionary</string>
			<key>pfm_description_reference</key>
			<string>Optional. If VPNType is VPN, this field is required. If the configuration is targeted at a VPN solution that uses a VPN plugin, then this field contains the bundle identifier of the plugin. Here are some examples:
- Cisco AnyConnect:
com.cisco.anyconnect.applevpn.plugin
- Juniper SSL: net.juniper.sslvpn
- F5 SSL: com.f5.F5-Edge-Client.vpnplugin
- SonicWALL Mobile Connect:
com.sonicwall.SonicWALL-SSLVPN.vpnplugin
- Aruba VIA:
com.arubanetworks.aruba-via.vpnplugin

If the configuration is targeted at a VPN solution that uses a NetworkExtension provider, then this field contains the bundle identifier of the app that contains the provider. Contact the VPN solution vendor for the value of the identifier. If VPNType is IKEv2, then the VPNSubType field is optional and is reserved for future use. If it is specified, it must contain the empty string.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPNSubType</string>
			<key>pfm_range_list</key>
			<array>
				<string>com.cisco.anyconnect</string>
				<string>com.cisco.anyconnect.applevpn.plugin</string>
				<string>net.juniper.sslvpn</string>
				<string>net.pulsesecure.PulseSecure.vpnplugin</string>
				<string>com.f5.F5-Edge-Client.vpnplugin</string>
				<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
				<string>com.arubanetworks.aruba-via.vpnplugin</string>
				<string>com.checkpoint.CheckPoint-VPN.vpnplugin</string>
				<!-- Not sure what to do about this, since the Custom SSL setting does not then have this listed -->
				<string></string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Cisco AnyConnect</string>
				<string>Cisco Legacy AnyConnect</string>
				<string>Juniper SSL</string>
				<string>Pulse Secure</string>
				<string>F5 SSL</string>
				<string>SonicWALL Mobile Connect</string>
				<string>Aruba VIA</string>
				<string>Check Point Mobile VPN</string>
				<string>Custom SSL</string>
			</array>
			<key>pfm_title</key>
			<string>VPN Subtype</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Optional. If the VPNSubType field contains the bundle identifier of an app that contains multiple VPN providers of the same type (app-proxy or packet-tunnel), then this field is used to specify which provider to use for this configuration.</string>
			<key>pfm_name</key>
			<string>ProviderBundleIdentifier</string>
			<key>pfm_title</key>
			<string>Provider Bundle Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_description</key>
			<string>A vendor specific configuration dictionary</string>
			<key>pfm_description_reference</key>
			<string>A dictionary for configuration information specific to a given third-party VPN solution</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VendorConfig</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Realm to connect to on the server</string>
					<key>pfm_name</key>
					<string>Realm</string>
					<key>pfm_title</key>
					<string>Realm</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Role to select when connecting to the server. Valid only for Juniper SSL</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>net.juniper.sslvpn</string>
										<string>net.pulsesecure.PulseSecure.vpnplugin</string>
									</array>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>Role</string>
					<key>pfm_title</key>
					<string>Role</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>com.cisco.anyconnect</string>
										<string>com.cisco.anyconnect.applevpn.plugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Group to connect to on the head end. Valid only for Cisco AnyConnect</string>
					<key>pfm_name</key>
					<string>Group</string>
					<key>pfm_title</key>
					<string>Group</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_range_list</key>
									<array>
										<string>com.sonicwall.SonicWALL-SSLVPN.vpnplugin</string>
									</array>
									<key>pfm_target</key>
									<string>VPNSubType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Login Group or Domain</string>
					<key>pfm_name</key>
					<string>LoginGroupOrDomain</string>
					<key>pfm_title</key>
					<string>Login Group or Domain</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Vendor Configuration Dictionary</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>HTTPEnable</key>
				<integer>0</integer>
				<key>HTTPSEnable</key>
				<integer>0</integer>
			</dict>
			<key>pfm_description</key>
			<string>Proxies</string>
			<key>pfm_name</key>
			<string>Proxies</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>HTTPEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTP</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTP Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Proxy URL</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxy</string>
					<key>pfm_title</key>
					<string>HTTP Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyPassword</string>
					<key>pfm_title</key>
					<string>HTTP ProxyPassword</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPProxyUsername</string>
					<key>pfm_title</key>
					<string>HTTP ProxyUsername</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>HTTPSEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable HTTPS</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_contains_any</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSPort</string>
					<key>pfm_range_max</key>
					<integer>65535</integer>
					<key>pfm_range_min</key>
					<integer>0</integer>
					<key>pfm_title</key>
					<string>HTTPS Port</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.HTTPSEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>HTTPSProxy</string>
					<key>pfm_title</key>
					<string>HTTPS Proxy</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>ProxyAutoConfigEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Proxy AutoConfig Enable</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
								<dict>
									<key>pfm_present</key>
									<true/>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigURLString</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoDiscoveryEnable</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Proxy Auto Discovery Enable</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>Proxies.ProxyAutoConfigEnable</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>ProxyAutoConfigURLString</string>
					<key>pfm_title</key>
					<string>Proxy Server URL</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Proxies</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>Password</string>
			</dict>
			<key>pfm_description</key>
			<string>VPN Settings</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>VPN</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>VPN</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The VPN account username</string>
					<key>pfm_description_reference</key>
					<string>The VPN account user name. Used for L2TP and PPTP.</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN user password</string>
					<key>pfm_description_reference</key>
					<string>Optional. Only visible if TokenCard is false. Used for L2TP and PPTP.</string>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Authentication method. Either shared secret or certificate</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>Password</string>
						<string>Certificate</string>
						<string>Password+Certificate</string>
					</array>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the certificate to use for account credentials</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_description_reference</key>
					<string>1 if the VPN connection should be brought up on demand, else 0.</string>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disabled</string>
						<string>Enabled</string>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string>Deprecated. A list of domain names. In versions of iOS prior to iOS 7, if the hostname ends with one of these domain names, the VPN is started automatically. In iOS 7 and later, if this key is present, the associated domain names are treated as though they were associated with the OnDemandMatchDomainsOnRetry key. This behavior can be overridden by OnDemandRules.</string>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string>Deprecated. A list of domain names. If the hostname ends with one of these domain names, the VPN is not started automatically. This might be used to exclude a subdomain within an included domain. This behavior can be overridden by OnDemandRules. In iOS 7 and later, this key is deprecated (but still supported) in favor of EvaluateConnection actions in the OnDemandRules dictionaries.</string>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_description_reference</key>
					<string>Deprecated. A list of domain names. If the hostname ends with one of these domain names, if a DNS query for that domain name fails, the VPN is started automatically. This behavior can be overridden by OnDemandRules. In iOS 7 and later, this key is deprecated (but still supported) in favor of EvaluateConnection actions in the OnDemandRules dictionaries.</string>
					<key>pfm_ios_deprecated</key>
					<string>7.0</string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of dictionaries defining On Demand Rules</string>
					<key>pfm_description_reference</key>
					<string>Determines when and how an on-demand VPN should be used. See On Demand Rules Dictionary Keys for details.</string>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An On Demand rule</string>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>An array of DNS addresses</string>
									<key>pfm_description_reference</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list. A wildcard '*' prefix is supported. For example, *.example.com matches against either mydomain.example.com or yourdomain.example.com.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A DNS address. May include wildcards</string>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of DNS Server Addresses</string>
									<key>pfm_description_reference</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array. Matching with a single wildcard is supported. For example, 17.* matches any DNS server in the class A 17 subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A DNS server address. May include wildcards</string>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A test URL</string>
									<key>pfm_description_reference</key>
									<string>A URL to probe. If this URL is successfully fetched (returning a 200 HTTP status code) without redirection, this rule matches.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>On Demand Action</string>
									<key>pfm_description_reference</key>
									<string>The action to take if this dictionary matches the current network. Possible values are:
- Allow: Deprecated. Allow VPN On Demand to connect if triggered.
- Connect: Unconditionally initiate a VPN connection on the
next network attempt.
- Disconnect: Tear down the VPN connection and do not reconnect on demand as long as this dictionary matches.
- EvaluateConnection: Evaluate the ActionParameters array for each connection attempt.
- Ignore: Leave any existing VPN connection up, but do not reconnect on demand as long as this dictionary matches.</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow (deprecated)</string>
										<string>Ignore</string>
										<string>Connect</string>
										<string>Disconnect</string>
										<string>Evaluate</string>
									</array>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Disconnect after an on demand connection idles</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>VPN.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>VPN</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Hostname or IP address for server</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_title</key>
					<string>Server</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>VPN</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict/>
			<key>pfm_description</key>
			<string>PPP Settings</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>PPTP</string>
								<string>L2TP</string>
								<string>IKEv2</string>
								<string>AlwaysOn</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>PPP</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>PPTP</string>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>The VPN account username</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>Account Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The VPN user password</string>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>Account Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Use a token card such as an RSA SecurID card for connecting</string>
					<key>pfm_description_reference</key>
					<string> Whether to use a token card such as an RSA SecurID card for connecting. Used for L2TP.</string>
					<key>pfm_name</key>
					<string>TokenCard</string>
					<key>pfm_title</key>
					<string>Use Token Card</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>PPTP</string>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>IP address or hostname of VPN server</string>
					<key>pfm_description_reference</key>
					<string>IP address or host name of VPN server. Used for L2TP and PPTP.</string>
					<key>pfm_name</key>
					<string>CommRemoteAddress</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Only present if RSA SecurID is being used, in which case it has one string entry: EAP-RSA</string>
					<key>pfm_description_reference</key>
					<string>Only present if RSA SecurID is being used, in which case it has one entry, a string with value "EAP-RSA". Used for L2TP and PPTP.</string>
					<key>pfm_name</key>
					<string>AuthEAPPlugins</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>String inside EAP Plugins array. If present, must be "EAP-RSA"</string>
							<key>pfm_name</key>
							<string>EAPPluginElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP-RSA</string>
								<string>EAP-TLS</string>
								<string>EAP-KRB</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_title</key>
							<string>EAP Plugin</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>EAP Plugins</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Only present if RSA SecurID is being used, in which case it has one string entry: EAP</string>
					<key>pfm_description_reference</key>
					<string>Only present if RSA SecurID is being used, in which case it has one entry, a string with value "EAP". Used for L2TP and PPTP.</string>
					<key>pfm_name</key>
					<string>AuthProtocol</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>String inside Auth Protocol array. If present, must be "EAP"</string>
							<key>pfm_name</key>
							<string>AuthProtocolElement</string>
							<key>pfm_range_list</key>
							<array>
								<string>EAP</string>
							</array>
							<key>pfm_repetition_max</key>
							<integer>1</integer>
							<key>pfm_repetition_min</key>
							<integer>1</integer>
							<key>pfm_title</key>
							<string>Auth Protocol</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Protocol</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPEnabled are true, represents maximum encryption level
</string>
					<key>pfm_description_reference</key>
					<string>See discussion under CCPEnabled. Used for PPTP.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE40Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE40</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPEnabled are true, represents automatic encryption level</string>
					<key>pfm_description_reference</key>
					<string>See discussion under CCPEnabled. Used for PPTP.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPMPPE128Enabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable CCPMPPE128</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enables encryption on the connection. If this key and CCPMPPE40Enabled are true, represents automatic encryption level; if this key and CCPMPPE128Enabled are true, represents maximum encryption level. If no encryption is used, then none of the CCP keys are true.</string>
					<key>pfm_description_reference</key>
					<string>Enables encryption on the connection. If this key and CCPMPPE40Enabled are true, represents automatic encryption level; if this key and CCPMPPE128Enabled are true, represents maximum encryption level. If no encryption is used, then none of the CCP keys are true. Used for PPTP.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>PPTP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CCPEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable CCP</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Disconnect after an on demand connection idles</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>PPP.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>PPP</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>SharedSecret</string>
				<key>LocalIdentifierType</key>
				<string>KeyID</string>
			</dict>
			<key>pfm_description</key>
			<string>Dictionary containing IPSec settings</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IPSec</string>
								<string>L2TP</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IPSec</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>IP address or hostname of the VPN server</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_title</key>
					<string>Remote Address</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>always</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>L2TP</string>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Authentication method. Either shared secret or certificate</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_range_list</key>
					<array>
						<string>SharedSecret</string>
						<string>Certificate</string>
					</array>
					<key>pfm_title</key>
					<string>Authentication Method</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Username for VPN account</string>
					<key>pfm_description_reference</key>
					<string>User name for VPN account. Used for Cisco IPSec.</string>
					<key>pfm_name</key>
					<string>XAuthName</string>
					<key>pfm_title</key>
					<string>Username</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_conditionals</key>
					<array>
						<dict>
							<key>pfm_require</key>
							<string>push</string>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_description</key>
					<string>Password for VPN account</string>
					<key>pfm_name</key>
					<string>XAuthPassword</string>
					<key>pfm_title</key>
					<string>Password</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>1 if XAUTH is ON, 0 if XAUTH is OFF</string>
					<key>pfm_description_reference</key>
					<string>1 if Xauth is on, 0 if it is off. Used for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Off</string>
						<string>On</string>
					</array>
					<key>pfm_title</key>
					<string>XAUTH Enabled</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>String value is either "Prompt" or not present</string>
					<key>pfm_description_reference</key>
					<string>Required for VPN account user authentication. Used for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>XAuthPasswordEncryption</string>
					<key>pfm_range_list</key>
					<array>
						<string>Prompt</string>
					</array>
					<key>pfm_title</key>
					<string>XAUTH Password Encryption</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The name of the group to use. If Hybrid Authentication is used, the string must end with "[hybrid]"</string>
					<key>pfm_description_reference</key>
					<string>Present only if AuthenticationMethod is SharedSecret. The name of the group to use. If Hybrid Authentication is used, the string must end with [hybrid]. Used for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_title</key>
					<string>Local Identifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Present only if AuthenticationMethod = SharedSecret. Must be "KeyID"</string>
					<key>pfm_description_reference</key>
					<string>Present only if AuthenticationMethod is SharedSecret. The value is KeyID. Used for L2TP and Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
										<string>L2TP</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>LocalIdentifierType</string>
					<key>pfm_range_list</key>
					<array>
						<string>KeyID</string>
					</array>
					<key>pfm_title</key>
					<string>Local Identifier Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The shared secret for this VPN account</string>
					<key>pfm_description_reference</key>
					<string>The shared secret for this VPN account. Only present if AuthenticationMethod is SharedSecret. Used for L2TP and Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>SharedSecret</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>Shared Secret</string>
					<key>pfm_type</key>
					<string>data</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the certificate to use for account credentials</string>
					<key>pfm_description_reference</key>
					<string>The UUID of the certificate to use for the account credentials. Only present if AuthenticationMethod is Certificate. Used for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IPSec.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Certificate UUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>If set, user will be prompted for a PIN when connecting</string>
					<key>pfm_description_reference</key>
					<string>Tells whether to prompt for a PIN when connecting. Used for Cisco IPSec.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>PromptForVPNPIN</string>
					<key>pfm_title</key>
					<string>Prompt for PIN</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable VPN On Demand</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsAlways</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainAlwaysElement</string>
							<key>pfm_title</key>
							<string>Match Domain Always Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Always</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>IPSec</string>
									</array>
									<key>pfm_target</key>
									<string>VPNType</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsNever</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainNeverElement</string>
							<key>pfm_title</key>
							<string>Match Domain Never Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains Never</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string></string>
					<key>pfm_name</key>
					<string>OnDemandMatchDomainsOnRetry</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>Match domain or host</string>
							<key>pfm_name</key>
							<string>MatchDomainOnRetryElement</string>
							<key>pfm_title</key>
							<string>Match Domain On Retry Element</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Match Domains On Retry</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>An array of dictionaries defining On Demand Rules</string>
					<key>pfm_name</key>
					<string>OnDemandRules</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An On Demand rule</string>
							<key>pfm_name</key>
							<string>OnDemandRulesElement</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string>An array of DNS addresses</string>
									<key>pfm_description_reference</key>
									<string>An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list. A wildcard '*' prefix is supported. For example, *.example.com matches against either mydomain.example.com or yourdomain.example.com.</string>
									<key>pfm_name</key>
									<string>DNSDomainMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A DNS address. May include wildcards</string>
											<key>pfm_name</key>
											<string>DNSDomainMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Domain Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Domain Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>An array of DNS Server Addresses</string>
									<key>pfm_description_reference</key>
									<string>An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array. Matching with a single wildcard is supported. For example, 17.* matches any DNS server in the class A 17 subnet.</string>
									<key>pfm_name</key>
									<string>DNSServerAddressMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>A DNS server address. May include wildcards</string>
											<key>pfm_name</key>
											<string>DNSServerAddressMatchElement</string>
											<key>pfm_title</key>
											<string>DNS Server Address Match Element</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>DNS Server Address Match</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>SSIDs to match against current network</string>
									<key>pfm_description_reference</key>
									<string>An array of SSIDs to match against the current network. If the network is not a Wi-Fi network or if the SSID does not appear in this array, the match fails. Omit this key and the corresponding array to match against any SSID.</string>
									<key>pfm_name</key>
									<string>SSIDMatch</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_name</key>
											<string>SSIDMatchElement</string>
											<key>pfm_title</key>
											<string>SSID</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>SSID Matches</string>
									<key>pfm_type</key>
									<string>array</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>A test URL</string>
									<key>pfm_description_reference</key>
									<string>A URL to probe. If this URL is successfully fetched (returning a 200 HTTP status code) without redirection, this rule matches.</string>
									<key>pfm_name</key>
									<string>URLStringProbe</string>
									<key>pfm_title</key>
									<string>URL String Probe</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>On Demand Action</string>
									<key>pfm_name</key>
									<string>Action</string>
									<key>pfm_range_list</key>
									<array>
										<string>Allow</string>
										<string>Ignore</string>
										<string>Connect</string>
										<string>Disconnect</string>
									</array>
									<key>pfm_title</key>
									<string>On Demand Action</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>On Demand Rules Element</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>On Demand Rules</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Disconnect after an on demand connection idles</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IPSec.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPSec Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Dictionary containing EAP settings</string>
			<key>pfm_name</key>
			<string>EAP</string>
			<key>pfm_subkeys</key>
			<array/>
			<key>pfm_title</key>
			<string>EAP Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>OverridePrimary</key>
				<integer>0</integer>
			</dict>
			<key>pfm_description</key>
			<string>Dictionary containing IPv4 settings</string>
			<key>pfm_description_reference</key>
			<string>Specifies whether to send all traffic through the VPN interface. If 1, all network traffic is sent over VPN. Defaults to 0.</string>
			<key>pfm_name</key>
			<string>IPv4</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>If set, all network traffic is sent over the VPN interface</string>
					<key>pfm_name</key>
					<string>OverridePrimary</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>No</string>
						<string>Yes</string>
					</array>
					<key>pfm_title</key>
					<string>Override Primary Connection</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IPv4 Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<dict>
				<key>AuthenticationMethod</key>
				<string>SharedSecret</string>
				<key>ChildSecurityAssociationParameters</key>
				<dict>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>EncryptionAlgorithm</key>
					<string>AES-256</string>
					<key>IntegrityAlgorithm</key>
					<string>SHA2-256</string>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
				</dict>
				<key>DeadPeerDetectionRate</key>
				<string>Medium</string>
				<key>DisableMOBIKE</key>
				<integer>0</integer>
				<key>DisableRedirect</key>
				<integer>0</integer>
				<key>EnableCertificateRevocationCheck</key>
				<integer>0</integer>
				<key>EnablePFS</key>
				<integer>0</integer>
				<key>IKESecurityAssociationParameters</key>
				<dict>
					<key>DiffieHellmanGroup</key>
					<integer>14</integer>
					<key>EncryptionAlgorithm</key>
					<string>AES-256</string>
					<key>IntegrityAlgorithm</key>
					<string>SHA2-256</string>
					<key>LifeTimeInMinutes</key>
					<integer>1440</integer>
				</dict>
				<key>UseConfigurationAttributeInternalIPSubnet</key>
				<integer>0</integer>
			</dict>
			<key>pfm_description</key>
			<string>IKEv2 settings</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>IKEv2</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string> IP address or hostname of the VPN server</string>
					<key>pfm_description_reference</key>
					<string>Required. IP address or hostname of the VPN server.</string>
					<key>pfm_format</key>
					<string>^[1-255]{4}.$</string>
					<key>pfm_name</key>
					<string>RemoteAddress</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>RemoteAddress</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Identifier of the IKEv2 client</string>
					<key>pfm_description_reference</key>
					<string>Required. Identifier of the IKEv2 client in one of the following formats:
- FQDN
- UserFQDN
- Address
- ASN1DN</string>
					<key>pfm_name</key>
					<string>LocalIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>LocalIdentifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Remote Identifier of the IKEv2 client</string>
					<key>pfm_description_reference</key>
					<string>Required. Remote identifier in one of the following formats:
- FQDN
- UserFQDN
- Address
- ASN1DN</string>
					<key>pfm_name</key>
					<string>RemoteIdentifier</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>RemoteIdentifier</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>AuthenticationMethod of the IKEv2 client</string>
					<key>pfm_description_reference</key>
					<string>Required. One of the following:
- SharedSecret
- Certificate
- None
To enable EAP-only authentication, the authentication method should be set to None and the ExtendedAuthEnabled key should be set to 1. If this key is set to None and the ExtendedAuthEnabled key is not set, the authentication configuration defaults to SharedSecret.</string>
					<key>pfm_name</key>
					<string>AuthenticationMethod</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>AuthenticationMethod</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The UUID of the identity certificate as the account credential</string>
					<key>pfm_description_reference</key>
					<string>Optional. The UUID of the identity certificate used as the account credential. If the value of AuthenticationMethod is Certificate, this certificate is sent out for IKEv2 machine authentication. If extended authentication (EAP) is used, it is sent out for EAP-TLS authentication.</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Value for IKE authentication</string>
					<key>pfm_description_reference</key>
					<string>Optional. If AuthenticationMethod is SharedSecret, this value is used for IKE authentication.</string>
					<key>pfm_name</key>
					<string>SharedSecret</string>
					<key>pfm_title</key>
					<string>SharedSecret</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to enable extended authentication (EAP)</string>
					<key>pfm_description_reference</key>
					<string>Optional. Set to 1 to enable EAP-only authentication (see AuthenticationMethod, above). Defaults to 0.</string>
					<key>pfm_name</key>
					<string>ExtendedAuthEnabled</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable Extended Authentication (EAP)</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Username used for authentication</string>
					<key>pfm_description_reference</key>
					<string>Optional. Username used for authentication.</string>
					<key>pfm_name</key>
					<string>AuthName</string>
					<key>pfm_title</key>
					<string>AuthName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Password used for authentication</string>
					<key>pfm_description_reference</key>
					<string>Optional. Password used for authentication.</string>
					<key>pfm_name</key>
					<string>AuthPassword</string>
					<key>pfm_title</key>
					<string>AuthPassword</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to disable IKEv2 redirect</string>
					<key>pfm_description_reference</key>
					<string>Optional. If set to 1, disables IKEv2 redirect. If not set, the IKEv2 connection would be redirected if a redirect request is received from the server. Defaults to 0. Availability: Available in iOS 9.0 and later.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>DisableRedirect</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>No</string>
						<string>Yes</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Redirect</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to disable MOBIKE negotiation in IKEv2</string>
					<key>pfm_description_reference</key>
					<string>Optional. If set to 1, disables MOBIKE. Defaults to 0. Availability: Available in iOS 9.0 and later.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>DisableMOBIKE</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Not Disabled</string>
						<string>Disabled</string>
					</array>
					<key>pfm_title</key>
					<string>Disable Mobility and Multihoming</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to indicate if negotiation should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET.</string>
					<key>pfm_description_reference</key>
					<string>Optional. If set to 1, negotiations should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET. Defaults to 0. Availability: Available in iOS 9.0 and later.</string>
					<key>pfm_ios_min</key>
					<string>9.0</string>
					<key>pfm_name</key>
					<string>UseConfigurationAttributeInternalIPSubnet</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Don't Use</string>
						<string>Use</string>
					</array>
					<key>pfm_title</key>
					<string>Use IPv4 / IPv6 Internal Subnet Attributes</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to enable Perfect Forward Secrecy for IKEv2 connections</string>
					<key>pfm_description_reference</key>
					<string>Optional. Set to 1 to enable Perfect Forward Secrecy (PFS) for IKEv2 Connections. Default is 0. Availability: Available in iOS 9.0 and later.</string>
					<key>pfm_name</key>
					<string>EnablePFS</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>Disable</string>
						<string>Enable</string>
					</array>
					<key>pfm_title</key>
					<string>Enable perfect forward secrecy</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>0</integer>
					<key>pfm_description</key>
					<string>Set to 1 to enable certificate revocation check for IKEv2 connections</string>
					<key>pfm_name</key>
					<string>EnableCertificateRevocationCheck</string>
					<key>pfm_title</key>
					<string>Enable certificate revocation check</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<string>Medium</string>
					<key>pfm_description</key>
					<string>Dead peer detection rate; defaults to Medium</string>
					<key>pfm_description_reference</key>
					<string>Optional. One of the following:
- None (Disable)
- Low (keepalive sent every 30 minutes)
- Medium (keepalive sent every 10 minutes)
- High (keepalive sent every 1 minute)
Defaults to Medium.</string>
					<key>pfm_name</key>
					<string>DeadPeerDetectionRate</string>
					<key>pfm_range_list</key>
					<array>
						<string>None</string>
						<string>Low</string>
						<string>Medium</string>
						<string>High</string>
					</array>
					<key>pfm_title</key>
					<string>Dead Peer Detection Rate</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Type of the certificate; defaults to RSA</string>
					<key>pfm_documentation_reference</key>
					<string>Optional. This key specifies the type of PayloadCertificateUUID used for IKEv2 machine authentication. Its value is one of the following:
- RSA (Default)
- ECDSA256
- ECDSA384
- ECDSA521
If this key is included, the ServerCertificateIssuerCommonName key is required.</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<string>Certificate</string>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.AuthenticationMethod</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>CertificateType</string>
					<key>pfm_range_list</key>
					<array>
						<string>RSCA</string>
						<string>ECDSA256</string>
						<string>ECDSA384</string>
						<string>ECDSA521</string>
					</array>
					<key>pfm_title</key>
					<string>Certificate Type</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Common Name of the server certificate issuer</string>
					<key>pfm_description_reference</key>
					<string>Optional. Common Name of the server certificate issuer. If set, this field will cause IKE to send a certificate request based on this certificate issuer to the server. This key is required if both the CertificateType key is included and the ExtendedAuthEnabled key is set to 1.</string>
					<key>pfm_name</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateIssuerCommonName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Common name of the server certificate</string>
					<key>pfm_description_reference</key>
					<string>Optional. Common Name of the server certificate. This name is used to validate the certificate sent by the IKE server. If not set, the Remote Identifier will be used to validate the certificate.</string>
					<key>pfm_name</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_title</key>
					<string>ServerCertificateCommonName</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<dict>
						<key>DiffieHellmanGroup</key>
						<integer>14</integer>
						<key>EncryptionAlgorithm</key>
						<string>AES-256</string>
						<key>IntegrityAlgorithm</key>
						<string>SHA2-256</string>
						<key>LifeTimeInMinutes</key>
						<integer>1440</integer>
					</dict>
					<key>pfm_description</key>
					<string>Applies to child Security Association</string>
					<key>pfm_name</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of:
- DES
- 3DES
- AES-128
- AES-256 (Default)
- AES-128-GCM (16-octet ICV)
- AES-256-GCM (16-octet ICV)</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
							</array>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of:
- SHA1-96
- SHA1-160
- SHA2-256 (Default)
- SHA2-384
- SHA2-512</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>3DES</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of: 1, 2, 5, 14 (Default), 15, 16, 17, 18, 19, 20, or 21.</string>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
							</array>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<integer>1440</integer>
							<key>pfm_description</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_description_reference</key>
							<string>Optional SA lifetime (rekey interval) in minutes. Valid values are 10 through 1440. Defaults to 1440 minutes.</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_unit</key>
							<string>minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>IKESecurityAssociationParameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<dict>
						<key>DiffieHellmanGroup</key>
						<integer>14</integer>
						<key>EncryptionAlgorithm</key>
						<string>AES-256</string>
						<key>IntegrityAlgorithm</key>
						<string>SHA2-256</string>
						<key>LifeTimeInMinutes</key>
						<integer>1440</integer>
					</dict>
					<key>pfm_description</key>
					<string>Applies to child Security Association</string>
					<key>pfm_name</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of:
- DES
- 3DES
- AES-128
- AES-256 (Default)
- AES-128-GCM (16-octet ICV)
- AES-256-GCM (16-octet ICV)</string>
							<key>pfm_name</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>DES</string>
								<string>3DES</string>
								<string>AES-128</string>
								<string>AES-256</string>
								<string>AES-128-GCM</string>
								<string>AES-256-GCM</string>
							</array>
							<key>pfm_title</key>
							<string>EncryptionAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of:
- SHA1-96
- SHA1-160
- SHA2-256 (Default)
- SHA2-384
- SHA2-512</string>
							<key>pfm_name</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_range_list</key>
							<array>
								<string>SHA1-96</string>
								<string>3DES</string>
								<string>SHA1-160</string>
								<string>SHA2-256</string>
								<string>SHA2-384</string>
								<string>SHA2-512</string>
							</array>
							<key>pfm_title</key>
							<string>IntegrityAlgorithm</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_description_reference</key>
							<string>Optional. One of: 1, 2, 5, 14 (Default), 15, 16, 17, 18, 19, 20, or 21.</string>
							<key>pfm_name</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_range_list</key>
							<array>
								<integer>1</integer>
								<integer>2</integer>
								<integer>5</integer>
								<integer>14</integer>
								<integer>15</integer>
								<integer>16</integer>
								<integer>17</integer>
								<integer>18</integer>
								<integer>19</integer>
								<integer>20</integer>
								<integer>21</integer>
							</array>
							<key>pfm_title</key>
							<string>DiffieHellmanGroup</string>
							<key>pfm_type</key>
							<string>integer</string>
						</dict>
						<dict>
							<key>pfm_description</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_description_reference</key>
							<string>Optional SA lifetime (rekey interval) in minutes. Valid values are 10 through 1440. Defaults to 1440 minutes.</string>
							<key>pfm_name</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_range_max</key>
							<integer>1440</integer>
							<key>pfm_range_min</key>
							<integer>10</integer>
							<key>pfm_title</key>
							<string>LifeTimeInMinutes</string>
							<key>pfm_type</key>
							<string>integer</string>
							<key>pfm_value_unit</key>
							<string>minutes</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>ChildSecurityAssociationParameters</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Disconnect after an on demand connection idles</string>
					<key>pfm_name</key>
					<string>DisconnectOnIdle</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
					</array>
					<key>pfm_title</key>
					<string>Enable Disconnect on Idle</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>Length of time to wait before disconnecting an on demand connection</string>
					<key>pfm_exclude</key>
					<array>
						<dict>
							<key>pfm_target_conditions</key>
							<array>
								<dict>
									<key>pfm_n_range_list</key>
									<array>
										<integer>1</integer>
									</array>
									<key>pfm_target</key>
									<string>IKEv2.DisconnectOnIdle</string>
								</dict>
							</array>
						</dict>
					</array>
					<key>pfm_name</key>
					<string>DisconnectOnIdleTimer</string>
					<key>pfm_title</key>
					<string>Disconnect on Idle time</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>IKEv2</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<string>IKEv2</string>
							</array>
							<key>pfm_target</key>
							<string>VPNType</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<dict>
				<key>AllowedCaptiveNetworkPlugins</key>
				<array/>
				<key>ServiceExceptions</key>
				<array/>
				<key>TunnelConfigurations</key>
				<array>
					<dict>
						<key>AuthenticationMethod</key>
						<string>SharedSecret</string>
						<key>ChildSecurityAssociationParameters</key>
						<dict>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>EncryptionAlgorithm</key>
							<string>AES-256</string>
							<key>IntegrityAlgorithm</key>
							<string>SHA2-256</string>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
						</dict>
						<key>DeadPeerDetectionRate</key>
						<string>Medium</string>
						<key>DisableMOBIKE</key>
						<integer>0</integer>
						<key>DisableRedirect</key>
						<integer>0</integer>
						<key>EnableCertificateRevocationCheck</key>
						<integer>0</integer>
						<key>EnablePFS</key>
						<integer>0</integer>
						<key>IKESecurityAssociationParameters</key>
						<dict>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>EncryptionAlgorithm</key>
							<string>AES-256</string>
							<key>IntegrityAlgorithm</key>
							<string>SHA2-256</string>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
						</dict>
						<key>Interfaces</key>
						<array>
							<string>Cellular</string>
						</array>
						<key>NATKeepAliveInterval</key>
						<integer>110</integer>
						<key>NATKeepAliveOffloadEnable</key>
						<integer>1</integer>
						<key>ProtocolType</key>
						<string>IKEv2</string>
						<key>UseConfigurationAttributeInternalIPSubnet</key>
						<integer>0</integer>
					</dict>
					<dict>
						<key>AuthenticationMethod</key>
						<string>SharedSecret</string>
						<key>ChildSecurityAssociationParameters</key>
						<dict>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>EncryptionAlgorithm</key>
							<string>AES-256</string>
							<key>IntegrityAlgorithm</key>
							<string>SHA2-256</string>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
						</dict>
						<key>DeadPeerDetectionRate</key>
						<string>Medium</string>
						<key>DisableMOBIKE</key>
						<integer>0</integer>
						<key>DisableRedirect</key>
						<integer>0</integer>
						<key>EnableCertificateRevocationCheck</key>
						<integer>0</integer>
						<key>EnablePFS</key>
						<integer>0</integer>
						<key>IKESecurityAssociationParameters</key>
						<dict>
							<key>DiffieHellmanGroup</key>
							<integer>14</integer>
							<key>EncryptionAlgorithm</key>
							<string>AES-256</string>
							<key>IntegrityAlgorithm</key>
							<string>SHA2-256</string>
							<key>LifeTimeInMinutes</key>
							<integer>1440</integer>
						</dict>
						<key>Interfaces</key>
						<array>
							<string>WiFi</string>
						</array>
						<key>NATKeepAliveInterval</key>
						<integer>20</integer>
						<key>NATKeepAliveOffloadEnable</key>
						<integer>1</integer>
						<key>ProtocolType</key>
						<string>IKEv2</string>
						<key>UseConfigurationAttributeInternalIPSubnet</key>
						<integer>0</integer>
					</dict>
				</array>
			</dict>
			<key>pfm_description</key>
			<string>Always On settings</string>
			<key>pfm_name</key>
			<string>AlwaysOn</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description</key>
					<string>This array contains an arbitrary number of TunnelConfigurations</string>
					<key>pfm_name</key>
					<string>TunnelConfigurations</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_description</key>
							<string>An item in theTunnelConfigurations array describing an individual configuration</string>
							<key>pfm_name</key>
							<string>TunnelConfiguration</string>
							<key>pfm_subkeys</key>
							<array>
								<dict>
									<key>pfm_description</key>
									<string> IP address or hostname of the VPN server</string>
									<key>pfm_name</key>
									<string>RemoteAddress</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>RemoteAddress</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Identifier of the IKEv2 client</string>
									<key>pfm_name</key>
									<string>LocalIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>LocalIdentifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Remote Identifier of the IKEv2 client</string>
									<key>pfm_name</key>
									<string>RemoteIdentifier</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>RemoteIdentifier</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>AuthenticationMethod of the IKEv2 client</string>
									<key>pfm_name</key>
									<string>AuthenticationMethod</string>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>AuthenticationMethod</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>The UUID of the identity certificate as the account credential</string>
									<key>pfm_name</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_title</key>
									<string>PayloadCertificateUUID</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Value for IKE authentication</string>
									<key>pfm_name</key>
									<string>SharedSecret</string>
									<key>pfm_title</key>
									<string>SharedSecret</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable extended authentication (EAP)</string>
									<key>pfm_name</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_title</key>
									<string>ExtendedAuthEnabled</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to disable IKEv2 redirect</string>
									<key>pfm_name</key>
									<string>DisableRedirect</string>
									<key>pfm_title</key>
									<string>Disable Redirect</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to disable MOBIKE negotiation in IKEv2</string>
									<key>pfm_name</key>
									<string>DisableMOBIKE</string>
									<key>pfm_title</key>
									<string>Disable Mobility and Multihoming</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to indicate if negotiation should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET and INTERNAL_IP6_SUBNET.</string>
									<key>pfm_name</key>
									<string>UseConfigurationAttributeInternalIPSubnet</string>
									<key>pfm_title</key>
									<string>Use IPv4 / IPv6 Internal Subnet Attributes</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable Perfect Forward Secrecy for IKEv2 connections</string>
									<key>pfm_name</key>
									<string>EnablePFS</string>
									<key>pfm_title</key>
									<string>Enable perfect forward secrecy</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>0</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable certificate revocation check for IKEv2 connections</string>
									<key>pfm_name</key>
									<string>EnableCertificateRevocationCheck</string>
									<key>pfm_title</key>
									<string>Enable certificate revocation check</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>1</integer>
									<key>pfm_description</key>
									<string>Set to 1 to enable NAT Keepalive offload for Always-on VPN IKEv2 connections</string>
									<key>pfm_description_reference</key>
									<string>Optional. Set to 1 to enable or 0 to disable NAT Keepalive offload for Always On VPN IKEv2 connections. Keepalive packets are sent by the device to maintain NAT mappings for IKEv2 connections that have a NAT on the path. Keepalive packets are sent at regular interval when the device is awake. If NATKeepAliveOffloadEnable is set to 1, Keepalive packets will be offloaded to hardware while the device is asleep. NAT Keepalive offload has an impact on the battery life since extra workload is added during sleep. The default interval for the Keepalive offload packets is 20 seconds over WiFi and 110 seconds over Cellular interface. The default NAT Keepalive works well on networks with small NAT mapping timeouts but imposes a potential battery impact. If a network is known to have larger NAT mapping timeouts, larger Keepalive intervals may be safely used to minimize battery impact. The Keepalive interval can be modified by setting the NATKeepAliveInterval key. Default value for NATKeepAliveOffloadEnable is 1.</string>
									<key>pfm_name</key>
									<string>NATKeepAliveOffloadEnable</string>
									<key>pfm_range_list</key>
									<array>
										<integer>0</integer>
										<integer>1</integer>
									</array>
									<key>pfm_range_list_titles</key>
									<array>
										<string>Disabled</string>
										<string>Enabled</string>
									</array>
									<key>pfm_title</key>
									<string>Enable NAT keepalive while the device is asleep</string>
									<key>pfm_type</key>
									<string>integer</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<integer>20</integer>
									<key>pfm_description</key>
									<string>NAT Keepalive interval for Always-on VPN IKEv2 connections. This value controls the interval over which Keepalive offload packets are sent by the device. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over Wi-Fi and 110 seconds over Cellular interface.</string>
									<key>pfm_documentation_reference</key>
									<string>Optional. NAT Keepalive interval for Always On VPN IKEv2 connections. This value controls the interval over which Keepalive offload packets are sent by the device. The minimum value is 20 seconds. If no key is specified, the default is 20 seconds over WiFi and 110 seconds over a Cellular interface.</string>
									<key>pfm_name</key>
									<string>NATKeepAliveInterval</string>
									<key>pfm_range_min</key>
									<integer>20</integer>
									<key>pfm_title</key>
									<string>NAT Keepalive Interval</string>
									<key>pfm_type</key>
									<string>integer</string>
									<key>pfm_value_unit</key>
									<string>seconds</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Username used for authentication</string>
									<key>pfm_name</key>
									<string>AuthName</string>
									<key>pfm_title</key>
									<string>AuthName</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Password used for authentication</string>
									<key>pfm_name</key>
									<string>AuthPassword</string>
									<key>pfm_title</key>
									<string>AuthPassword</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>Low</string>
									<key>pfm_description</key>
									<string>Dead peer detection rate; defaults to Medium</string>
									<key>pfm_name</key>
									<string>DeadPeerDetectionRate</string>
									<key>pfm_title</key>
									<string>Dead Peer Detection Rate</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<string>IKEv2</string>
									<key>pfm_description</key>
									<string>In always-on, must be "IKEv2"</string>
									<key>pfm_name</key>
									<string>ProtocolType</string>
									<key>pfm_range_list</key>
									<array>
										<string>IKEv2</string>
									</array>
									<key>pfm_require</key>
									<string>always</string>
									<key>pfm_title</key>
									<string>Protocol Type</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_conditionals</key>
									<array>
										<dict>
											<key>pfm_require</key>
											<string>always</string>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_contains_any</key>
													<array>
														<string>Certificate</string>
													</array>
													<key>pfm_target</key>
													<string>IKEv2.AuthenticationMethod</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_description</key>
									<string>Common Name of the server certificate issuer</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[0].AuthenticationMethod</string>
												</dict>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[1].AuthenticationMethod</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_title</key>
									<string>ServerCertificateIssuerCommonName</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_description</key>
									<string>Common Name of the server certificate</string>
									<key>pfm_exclude</key>
									<array>
										<dict>
											<key>pfm_target_conditions</key>
											<array>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[0].AuthenticationMethod</string>
												</dict>
												<dict>
													<key>pfm_n_range_list</key>
													<array>
														<string>Certificate</string>
													</array>
													<key>pfm_target</key>
													<string>AlwaysOn.TunnelConfigurations.[1].AuthenticationMethod</string>
												</dict>
											</array>
										</dict>
									</array>
									<key>pfm_name</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_title</key>
									<string>ServerCertificateCommonName</string>
									<key>pfm_type</key>
									<string>string</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<dict>
										<key>DiffieHellmanGroup</key>
										<integer>14</integer>
										<key>EncryptionAlgorithm</key>
										<string>AES-256</string>
										<key>IntegrityAlgorithm</key>
										<string>SHA2-256</string>
										<key>LifeTimeInMinutes</key>
										<integer>1440</integer>
									</dict>
									<key>pfm_description</key>
									<string>Applies to child Security Association</string>
									<key>pfm_name</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_title</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_title</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_title</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_title</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>IKESecurityAssociationParameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
								<dict>
									<key>pfm_default</key>
									<dict>
										<key>DiffieHellmanGroup</key>
										<integer>14</integer>
										<key>EncryptionAlgorithm</key>
										<string>AES-256</string>
										<key>IntegrityAlgorithm</key>
										<string>SHA2-256</string>
										<key>LifeTimeInMinutes</key>
										<integer>1440</integer>
									</dict>
									<key>pfm_description</key>
									<string>Applies to child Security Association</string>
									<key>pfm_name</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_subkeys</key>
									<array>
										<dict>
											<key>pfm_description</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_name</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_title</key>
											<string>EncryptionAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_name</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_title</key>
											<string>IntegrityAlgorithm</string>
											<key>pfm_type</key>
											<string>string</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_name</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_title</key>
											<string>DiffieHellmanGroup</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
										<dict>
											<key>pfm_description</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_name</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_title</key>
											<string>LifeTimeInMinutes</string>
											<key>pfm_type</key>
											<string>integer</string>
										</dict>
									</array>
									<key>pfm_title</key>
									<string>ChildSecurityAssociationParameters</string>
									<key>pfm_type</key>
									<string>dictionary</string>
								</dict>
							</array>
							<key>pfm_title</key>
							<string>A TunnelConfiguration</string>
							<key>pfm_type</key>
							<string>dictionary</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>TunnelConfigurations</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>AlwaysOn</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
		<string>user</string>
	</array>
	<key>pfm_title</key>
	<string>VPN</string>
	<key>pfm_unique</key>
	<false/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
