<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Accessibility Settings</string>
	<key>pfm_domain</key>
	<string>com.apple.universalaccess</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2019-01-02T08:58:52Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Universal Access settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Universal Access</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.universalaccess</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Vision</string>
				<string>Media</string>
				<string>Hearing</string>
				<string>Interacting</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>axShortcutExposedFeatures</string>
				</array>
				<key>Vision</key>
				<array>
					<string>PFC_SegmentedControl_Vision</string>
					<string>PFC_SegmentedControl_ZoomOptions</string>
					<string>closeViewHotkeysEnabled</string>
					<string>closeViewFarPoint</string>
					<string>closeViewFlashScreenOnNotificationEnabled</string>
					<string>closeViewFullscreenPoroEnabled</string>
					<string>closeViewNearPoint</string>
					<string>closeViewPanningMode</string>
					<string>closeViewScrollWheelToggle</string>
					<string>closeViewScrollWheelModifiersInt</string>
					<string>closeViewShowPreview</string>
					<string>closeViewSmoothImages</string>
					<string>closeViewTemporaryDetachEnabled</string>
					<string>closeViewZoomFollowsFocus</string>
					<string>closeViewZoomMode</string>
					<string>contrast</string>
					<string>differentiateWithoutColor</string>
					<string>grayscale</string>
					<string>increaseContrast</string>
					<string>mouseDriverCursorSize</string>
					<string>reduceMotion</string>
					<string>reduceTransparency</string>
					<string>speakItemUnderMouseAfterDelayMode</string>
					<string>speakItemUnderMouseAfterDelayTime</string>
					<string>voiceOverOnOffKey</string>
					<string>whiteOnBlack</string>
				</array>
				<key>Media</key>
				<array>
					<string></string>
				</array>
				<key>Hearing</key>
				<array>
					<string>flashScreen</string>
					<string>stereoAsMono</string>
				</array>
				<key>Interacting</key>
				<array>
					<string>PFC_SegmentedControl_Interacting</string>
					<string>PFC_SegmentedControl_Keyboard</string>
					<string>PFC_SegmentedControl_KeyboardHardwareOptions</string>
					<string>PFC_SegmentedControl_KeyboardAccessibilityKeyboardOptions</string>
					<string>PFC_SegmentedControl_SwitchControl</string>
					<string>PFC_SegmentedControl_SwitchTiming</string>
					<string>dwellActionType</string>
					<string>dwellAlwaysShowMenuExtra</string>
					<string>dwellAlwaysAllowInPanels</string>
					<string>dwellAutoRevertToLeftClickEnabled</string>
					<string>dwellEnabled</string>
					<string>dwellHideProgressIndicators</string>
					<string>dwellHideUIEnabled</string>
					<string>dwellHideUITimeout</string>
					<string>dwellHomePanelFollowTriggeredHotCornerEnabled</string>
					<string>dwellShowActionsInPanels</string>
					<string>dwellTimeAssistiveControlUI</string>
					<string>dwellTimeDefaultAction</string>
					<string>dwellTimeZoom</string>
					<string>dwellTolerance</string>
					<string>dwellZoomEnabled</string>
					<string>mouseDriver</string>
					<string>mouseDriverInitialDelay</string>
					<string>mouseDriverIgnoreTrackpad</string>
					<string>mouseDriverMaxSpeed</string>
					<string>slowKey</string>
					<string>slowKeyBeepOn</string>
					<string>slowKeyDelay</string>
					<string>stickyKey</string>
					<string>stickyKeyBeepOnModifier</string>
					<string>stickyKeyShowWindow</string>
					<string>stickyKeysLocation</string>
					<string>switchAutoScanElementInterval</string>
					<string>switchAutoScanPanelInterval</string>
					<string>switchCoalescePressesDuration</string>
					<string>switchCursorSize</string>
					<string>switchElementRestartOption</string>
					<string>switchFirstElementDelay</string>
					<string>switchHideUIEnabled</string>
					<string>switchHideUITimeout</string>
					<string>switchHoldBeforeRepeatDuration</string>
					<string>switchMinimumPressDuration</string>
					<string>switchMouseMoveStyle</string>
					<string>switchOnOffKey</string>
					<string>switchPlaySounds</string>
					<string>switchResumeAutoScanningAfterSelectEnabled</string>
					<string>switchReverseMouseWhenReachingScreenEdge</string>
					<string>switchScanCycleCount</string>
					<string>switchSpeakSelectedElement</string>
					<string>switchSweepingCursorSpeed</string>
					<string>useMouseKeysShortcutKeys</string>
					<string>useStickyKeysShortcutKeys</string>
					<string>virtualKeyboardCornerActionType</string>
					<string>virtualKeyboardHideUITransparencyLevel</string>
					<string>virtualKeyboardMouseOption</string>
					<string>virtualKeyboardOnOff</string>
					<string>virtualKeyboardPlaySounds</string>
					<string>virtualKeyboardCornerActionType</string>
					<string>virtualKeyboardOnOff</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Dictionary of accessibility shortcuts that are either accessible or not from the accessibility shortcut menu: ⌥ Option + ⌘ Command + F5.</string>
			<key>pfm_name</key>
			<string>axShortcutExposedFeatures</string>
			<key>pfm_title</key>
			<string>Visible Accessibility Shortcuts</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.invertDisplayColor</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Invert Display Color</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.mouseKeys</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Mouse Keys</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.slowKeys</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Slow Keys</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.stickyKeys</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Sticky Keys</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.switchControl</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Switch Control</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.virtualKeyboard</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Enable Accessibility Keyboard</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.voiceOver</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>VoiceOver</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<true/>
					<key>pfm_name</key>
					<string>feature.zoom</string>
					<key>pfm_required</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Zoom</string>
					<key>pfm_type</key>
					<string>boolean</string>
				</dict>
			</array>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>stereoAsMono</string>
			<key>pfm_title</key>
			<string>Play stereo audio as mono</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Flash the screen when an alert sound occurs</string>
			<key>pfm_name</key>
			<string>flashScreen</string>
			<key>pfm_title</key>
			<string>Flash screen on alert sound</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Vision</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>VoiceOver</string>
				<string>Zoom</string>
				<string>Display</string>
				<string>Speech</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>VoiceOver</key>
				<array>
					<string>voiceOverOnOffKey</string>
				</array>
				<key>Zoom</key>
				<array>
					<string>PFC_SegmentedControl_ZoomOptions</string>
					<string>closeViewHotkeysEnabled</string>
					<string>closeViewFarPoint</string>
					<string>closeViewFlashScreenOnNotificationEnabled</string>
					<string>closeViewFullscreenPoroEnabled</string>
					<string>closeViewNearPoint</string>
					<string>closeViewPanningMode</string>
					<string>closeViewScrollWheelToggle</string>
					<string>closeViewScrollWheelModifiersInt</string>
					<string>closeViewShowPreview</string>
					<string>closeViewSmoothImages</string>
					<string>closeViewTemporaryDetachEnabled</string>
					<string>closeViewZoomFollowsFocus</string>
					<string>closeViewZoomMode</string>
					<string>speakItemUnderMouseAfterDelayMode</string>
					<string>speakItemUnderMouseAfterDelayTime</string>
				</array>
				<key>Display</key>
				<array>
					<string>contrast</string>
					<string>differentiateWithoutColor</string>
					<string>grayscale</string>
					<string>increaseContrast</string>
					<string>mouseDriverCursorSize</string>
					<string>reduceMotion</string>
					<string>reduceTransparency</string>
					<string>whiteOnBlack</string>
				</array>
				<key>Speech</key>
				<array>
					<string></string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewHotkeysEnabled</string>
			<key>pfm_title</key>
			<string>Enable Zoom via Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewScrollWheelToggle</string>
			<key>pfm_title</key>
			<string>Enable Zoom via ScrollWheel</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>closeViewScrollWheelToggle</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>closeViewScrollWheelToggle</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>closeViewScrollWheelModifiersInt</string>
			<key>pfm_range_list</key>
			<array>
				<integer>262144</integer>
				<integer>524288</integer>
				<integer>1048576</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>^ Control</string>
				<string>⌥ Option</string>
				<string>⌘ Command</string>
			</array>
			<key>pfm_title</key>
			<string>Use scroll gesture with modifier keys to zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewSmoothImages</string>
			<key>pfm_title</key>
			<string>Smooth images</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewZoomFollowsFocus</string>
			<key>pfm_title</key>
			<string>Zoom follows the keyboard focus</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>speakItemUnderMouseAfterDelayMode</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>No / Disabled</string>
				<string>Only when zoomed</string>
				<string>Picture-in-picture</string>
			</array>
			<key>pfm_title</key>
			<string>Speak items under the pointer</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_n_range_list</key>
							<array>
								<integer>0</integer>
							</array>
							<key>pfm_target</key>
							<string>speakItemUnderMouseAfterDelayMode</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>speakItemUnderMouseAfterDelayTime</string>
			<key>pfm_range_max</key>
			<real>5</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Only when zoomed</string>
				<string>Picture-in-picture</string>
			</array>
			<key>pfm_title</key>
			<string>Speak items under pointer after delay</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>Short - Long</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewZoomMode</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Full Screen</string>
				<string>Picture-in-picture</string>
			</array>
			<key>pfm_title</key>
			<string>Zoom style</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>whiteOnBlack</string>
			<key>pfm_title</key>
			<string>Invert colors</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>reduceMotion</string>
			<key>pfm_title</key>
			<string>Reduce motion</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>grayscale</string>
			<key>pfm_title</key>
			<string>Use grayscale</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>reduceTransparency</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>increaseContrast</string>
			<key>pfm_title</key>
			<string>Increase contrast</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>differentiateWithoutColor</string>
			<key>pfm_title</key>
			<string>Differentiate without color</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>reduceTransparency</string>
			<key>pfm_title</key>
			<string>Reduce transparency</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<!-- Until decimal values are respected per issue https://github.com/erikberglund/ProfileCreator/issues/110, this preference won't work.
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_description</key>
			<string>Value between 0.0 and 1.</string>
			<key>pfm_name</key>
			<string>contrast</string>
			<key>pfm_range_max</key>
			<real>1</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Display contrast</string>
			<key>pfm_type</key>
			<string>float</string>
		</dict>
		 -->
		<dict>
			<key>pfm_description</key>
			<string>Mouse Cursor Size. 1 is normal, 4 is maximum.</string>
			<key>pfm_name</key>
			<string>mouseDriverCursorSize</string>
			<key>pfm_range_max</key>
			<real>4</real>
			<key>pfm_range_min</key>
			<real>1</real>
			<key>pfm_title</key>
			<string>Cursor Size</string>
			<key>pfm_type</key>
			<string>real</string>
			<key>pfm_value_unit</key>
			<string>Normal - Large</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_ZoomOptions</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Zoom Options</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Zoom Options</key>
				<array>
					<string>closeViewFarPoint</string>
					<string>closeViewFlashScreenOnNotificationEnabled</string>
					<string>closeViewFullscreenPoroEnabled</string>
					<string>closeViewNearPoint</string>
					<string>closeViewShowPreview</string>
					<string>closeViewTemporaryDetachEnabled</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>20</integer>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewNearPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Maximum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2</integer>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewFarPoint</string>
			<key>pfm_range_max</key>
			<integer>40</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Minimum Zoom</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewShowPreview</string>
			<key>pfm_title</key>
			<string>Show preview rectangle when zoomed out</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewFullscreenPoroEnabled</string>
			<key>pfm_title</key>
			<string>Hold ^⌥ to temporarily toggle zoom</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewTemporaryDetachEnabled</string>
			<key>pfm_title</key>
			<string>Hold ^⌘ to temporarily detach zoom view from pointer</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewFlashScreenOnNotificationEnabled</string>
			<key>pfm_title</key>
			<string>Flash screen when notification banner appears outside zoom window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>closeViewPanningMode</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Continuously with pointer</string>
				<string>Only when the pointer reaches an edge</string>
				<string>So the pointer is at or near the center of the screen</string>
			</array>
			<key>pfm_title</key>
			<string>When zoomed in, the screen image moves ...</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>VoiceOver provides spoken and brailled descriptions of items on the computer screen and provides control of the computer through the user of the keyboard.</string>
			<key>pfm_name</key>
			<string>voiceOverOnOffKey</string>
			<key>pfm_title</key>
			<string>Enable VoiceOver</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Interacting</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Dictation</string>
				<string>Siri</string>
				<string>Keyboard</string>
				<string>Mouse &amp; Trackpad</string>
				<string>Switch Control</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Dictation</key>
				<array>
					<string></string>
				</array>
				<key>Siri</key>
				<array>
					<string></string>
				</array>
				<key>Keyboard</key>
				<array>
					<string>PFC_SegmentedControl_Keyboard</string>
					<string>PFC_SegmentedControl_KeyboardHardwareOptions</string>
					<string>PFC_SegmentedControl_KeyboardAccessibilityKeyboardOptions</string>
					<string>dwellActionType</string>
					<string>dwellAlwaysShowMenuExtra</string>
					<string>dwellAlwaysAllowInPanels</string>
					<string>dwellAutoRevertToLeftClickEnabled</string>
					<string>dwellEnabled</string>
					<string>dwellHideProgressIndicators</string>
					<string>dwellHideUIEnabled</string>
					<string>dwellHideUITimeout</string>
					<string>dwellHomePanelFollowTriggeredHotCornerEnabled</string>
					<string>dwellShowActionsInPanels</string>
					<string>dwellTimeAssistiveControlUI</string>
					<string>dwellTimeDefaultAction</string>
					<string>dwellTimeZoom</string>
					<string>dwellTolerance</string>
					<string>dwellZoomEnabled</string>
					<string>slowKey</string>
					<string>slowKeyBeepOn</string>
					<string>slowKeyDelay</string>
					<string>stickyKey</string>
					<string>stickyKeyBeepOnModifier</string>
					<string>stickyKeyShowWindow</string>
					<string>stickyKeysLocation</string>
					<string>useStickyKeysShortcutKeys</string>
					<string>virtualKeyboardCornerActionType</string>
					<string>virtualKeyboardHideUITransparencyLevel</string>
					<string>virtualKeyboardMouseOption</string>
					<string>virtualKeyboardOnOff</string>
					<string>virtualKeyboardPlaySounds</string>
				</array>
				<key>Mouse &amp; Trackpad</key>
				<array>
					<string>mouseDriver</string>
					<string>mouseDriverInitialDelay</string>
					<string>mouseDriverIgnoreTrackpad</string>
					<string>mouseDriverMaxSpeed</string>
					<string>useMouseKeysShortcutKeys</string>
				</array>
				<key>Switch Control</key>
				<array>
					<string>PFC_SegmentedControl_SwitchControl</string>
					<string>PFC_SegmentedControl_SwitchTiming</string>
					<string>switchAutoScanElementInterval</string>
					<string>switchAutoScanPanelInterval</string>
					<string>switchCoalescePressesDuration</string>
					<string>switchCursorSize</string>
					<string>switchElementRestartOption</string>
					<string>switchFirstElementDelay</string>
					<string>switchHideUIEnabled</string>
					<string>switchHideUITimeout</string>
					<string>switchHoldBeforeRepeatDuration</string>
					<string>switchMinimumPressDuration</string>
					<string>switchMouseMoveStyle</string>
					<string>switchOnOffKey</string>
					<string>switchPlaySounds</string>
					<string>switchResumeAutoScanningAfterSelectEnabled</string>
					<string>switchReverseMouseWhenReachingScreenEdge</string>
					<string>switchScanCycleCount</string>
					<string>switchSpeakSelectedElement</string>
					<string>switchSweepingCursorSpeed</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Mouse Keys allows the mouse pointer to be controlled using the keyboard number pad.</string>
			<key>pfm_name</key>
			<string>mouseDriver</string>
			<key>pfm_title</key>
			<string>Enable Mouse Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>1.125</real>
			<key>pfm_description</key>
			<string>Initial mouse key delay.</string>
			<key>pfm_name</key>
			<string>mouseDriverInitialDelay</string>
			<key>pfm_range_list</key>
			<array>
				<real>0.3333333432674408</real>
				<real>0.5</real>
				<real>0.75</real>
				<real>1.125</real>
				<real>1.6875</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Short</string>
				<string>Medium-Short</string>
				<string>Medium</string>
				<string>Medium-Long</string>
				<string>Long</string>
			</array>
			<key>pfm_title</key>
			<string>Initial delay</string>
			<key>pfm_type</key>
			<string>float</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>11</integer>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>mouseDriverMaxSpeed</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>6</integer>
				<integer>8</integer>
				<integer>11</integer>
				<integer>19</integer>
				<integer>24</integer>
				<integer>29</integer>
				<integer>32</integer>
			</array>
			<key>pfm_title</key>
			<string>Maximum speed</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>Slow - Fast</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Ignore built-in trackpad when Mouse Keys is on</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>useMouseKeysShortcutKeys</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>mouseDriverIgnoreTrackpad</string>
			<key>pfm_title</key>
			<string>Ignore built-in trackpad</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_Keyboard</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Hardware</string>
				<string>Accessibility Keyboard</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Hardware</key>
				<array>
					<string>PFC_SegmentedControl_KeyboardHardwareOptions</string>
					<string>slowKey</string>
					<string>slowKeyBeepOn</string>
					<string>slowKeyDelay</string>
					<string>stickyKey</string>
					<string>stickyKeyBeepOnModifier</string>
					<string>stickyKeyShowWindow</string>
					<string>stickyKeysLocation</string>
					<string>useStickyKeysShortcutKeys</string>
				</array>
				<key>Accessibility Keyboard</key>
				<array>
					<string>PFC_SegmentedControl_KeyboardAccessibilityKeyboardOptions</string>
					<string>dwellActionType</string>
					<string>dwellAlwaysShowMenuExtra</string>
					<string>dwellAlwaysAllowInPanels</string>
					<string>dwellAutoRevertToLeftClickEnabled</string>
					<string>dwellEnabled</string>
					<string>dwellHideProgressIndicators</string>
					<string>dwellHideUIEnabled</string>
					<string>dwellHideUITimeout</string>
					<string>dwellHomePanelFollowTriggeredHotCornerEnabled</string>
					<string>dwellShowActionsInPanels</string>
					<string>dwellTimeAssistiveControlUI</string>
					<string>dwellTimeDefaultAction</string>
					<string>dwellTimeZoom</string>
					<string>dwellTolerance</string>
					<string>dwellZoomEnabled</string>
					<string>virtualKeyboardCornerActionType</string>
					<string>virtualKeyboardHideUITransparencyLevel</string>
					<string>virtualKeyboardMouseOption</string>
					<string>virtualKeyboardOnOff</string>
					<string>virtualKeyboardPlaySounds</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>The Accessibility Keyboard lets you type and interact with macOS without using a hardware keyboard.</string>
			<key>pfm_name</key>
			<string>virtualKeyboardOnOff</string>
			<key>pfm_title</key>
			<string>Enable Accessibility Keyboard</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Preference fades the accessibility keyboard panel after configured dwellHideUITimeout seconds.</string>			
			<key>pfm_name</key>
			<string>dwellHideUIEnabled</string>
			<key>pfm_title</key>
			<string>Fade panel after inactivity</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>dwellHideUIEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<real>15</real>
			<key>pfm_description</key>
			<string>Fades the accessibility keyboard panel after X seconds of inactivity.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>dwellHideUIEnabled</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>virtualKeyboardHideUITransparencyLevel</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>dwellHideUITimeout</string>
			<key>pfm_title</key>
			<string>Fade Accessbility Keyboard panel after inactivity</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>dwellHideUIEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Preference sets the fade percentage of the Accessibility Keyboard after X seconds of inactivity.</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>dwellHideUIEnabled</string>
						</dict>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>dwellHideUITimeout</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>virtualKeyboardHideUITransparencyLevel</string>
			<key>pfm_range_list</key>
			<array>
				<real>0.0</real>
				<real>0.05000000074505806</real>
				<real>0.10000000149011612</real>
				<real>0.15000000596046448</real>
				<real>0.20000000298023224</real>
				<real>0.25</real>
				<real>0.30000001192092896</real>
				<real>0.34999999403953552</real>
				<real>0.40000000596046448</real>
				<real>0.44999998807907104</real>
				<real>0.5</real>
				<real>0.55000001192092896</real>
				<real>0.60000002384185791</real>
				<real>0.64999997615814209</real>
				<real>0.69999998807907104</real>
				<real>0.75</real>
				<real>0.80000001192092896</real>
				<real>0.85000002384185791</real>
				<real>0.89999997615814209</real>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>100%</string>
				<string>95%</string>
				<string>90%</string>
				<string>85%</string>
				<string>80%</string>
				<string>75%</string>
				<string>70%</string>
				<string>65%</string>
				<string>60%</string>
				<string>55%</string>
				<string>50%</string>
				<string>45%</string>
				<string>40%</string>
				<string>35%</string>
				<string>30%</string>
				<string>25%</string>
				<string>20%</string>
				<string>15%</string>
				<string>10%</string>
			</array>
			<key>pfm_title</key>
			<string>Fade by</string>
			<key>pfm_type</key>
			<string>float</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Play key sounds for Accessibility Keyboard</string>
			<key>pfm_name</key>
			<string>virtualKeyboardPlaySounds</string>
			<key>pfm_title</key>
			<string>Play key sounds</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Determines whether Accessibility Keyboard keys are entered when the mouse is pressed down or when the mouse is released.</string>
			<key>pfm_name</key>
			<string>virtualKeyboardMouseOption</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Mouse down</string>
				<string>Mouse up</string>
			</array>
			<key>pfm_title</key>
			<string>Keys should be entered on</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<false/>
							</array>
							<key>pfm_target</key>
							<string>mouseDriverIgnoreTrackpad</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>useMouseKeysShortcutKeys</string>
			<key>pfm_title</key>
			<string>Press the Option key five times to toggle Mouse Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_KeyboardAccessibilityKeyboardOptions</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Hot Corners</string>
				<string>Dwell Options</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Hot Corners</key>
				<array>
					<string>virtualKeyboardCornerActionType</string>
					<string>dwellHomePanelFollowTriggeredHotCornerEnabled</string>
				</array>
				<key>Dwell Options</key>
				<array>
					<string>dwellActionType</string>
					<string>dwellAlwaysShowMenuExtra</string>
					<string>dwellAlwaysAllowInPanels</string>
					<string>dwellAutoRevertToLeftClickEnabled</string>
					<string>dwellEnabled</string>
					<string>dwellHideProgressIndicators</string>
					<string>dwellHideUIEnabled</string>
					<string>dwellHideUITimeout</string>
					<string>dwellShowActionsInPanels</string>
					<string>dwellTimeAssistiveControlUI</string>
					<string>dwellTimeDefaultAction</string>
					<string>dwellTimeZoom</string>
					<string>dwellTolerance</string>
					<string>dwellZoomEnabled</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellEnabled</string>
			<key>pfm_title</key>
			<string>Dwell enabled</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>dwellEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>dwellShowActionsInPanels</string>
			<key>pfm_title</key>
			<string>Show dwell actions in panels</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellAlwaysShowMenuExtra</string>
			<key>pfm_title</key>
			<string>Show dwell actions in menu bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellAlwaysAllowInPanels</string>
			<key>pfm_title</key>
			<string>Always dwell in panels</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellZoomEnabled</string>
			<key>pfm_title</key>
			<string>Enable Dwell Zoom</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>dwellZoomEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<real>2</real>
			<key>pfm_description</key>
			<string>The number of seconds can be increments of .25.</string>
			<key>pfm_name</key>
			<string>dwellTimeZoom</string>
			<key>pfm_range_max</key>
			<real>8</real>
			<key>pfm_range_min</key>
			<real>0.25</real>
			<key>pfm_title</key>
			<string>Dwell Zoom After</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellHideProgressIndicators</string>
			<key>pfm_title</key>
			<string>Hide dwell time indicators</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Keyboard action to be taken when the default dwell time has been reached.</string>
			<!-- If dwellActionType is any value other than 2, dwellEnabled must be true.  Only when dwellActionType is 2 should dwellEnabled be false.  Not sure how to accomplish this ...
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<integer>2</integer>
							</array>
							<key>pfm_target</key>
							<string>dwellActionType</string>
						</dict>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>dwellEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			-->
			<key>pfm_name</key>
			<string>dwellActionType</string>
			<key>pfm_range_list</key>
			<array>
				<integer>2</integer>
				<integer>3</integer>
				<integer>5</integer>
				<integer>4</integer>
				<integer>6</integer>
				<integer>7</integer>
				<integer>8</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Pause Dwell</string>
				<string>Left Click</string>
				<string>Double Click</string>
				<string>Right Click</string>
				<string>Drag and Drop</string>
				<string>Scroll Menu</string>
				<string>Options Menu</string>
			</array>
			<key>pfm_title</key>
			<string>Dwell action</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellAutoRevertToLeftClickEnabled</string>
			<key>pfm_title</key>
			<string>Auto revert to left click</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>3</real>
			<key>pfm_description</key>
			<string>The number of seconds can be increments of .25.</string>
			<key>pfm_name</key>
			<string>dwellTimeDefaultAction</string>
			<key>pfm_range_max</key>
			<real>8</real>
			<key>pfm_range_min</key>
			<real>0.25</real>
			<key>pfm_title</key>
			<string>Default dwell time</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>2</real>
			<key>pfm_description</key>
			<string>The number of seconds can be increments of .25.</string>
			<key>pfm_name</key>
			<string>dwellTimeAssistiveControlUI</string>
			<key>pfm_range_max</key>
			<real>8</real>
			<key>pfm_range_min</key>
			<real>0.25</real>
			<key>pfm_title</key>
			<string>Panel dwell time</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>20</real>
			<key>pfm_description</key>
			<string>The number of pixels can be entered to the nearest hundreth - ex. 45.45.</string>
			<key>pfm_name</key>
			<string>dwellTolerance</string>
			<key>pfm_range_max</key>
			<real>200</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Dwell movement tolerance</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>pixels</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Pick the one time action to be performed after dwelling on a screen corner.</string>
			<key>pfm_name</key>
			<string>virtualKeyboardCornerActionType</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_name</key>
					<string>0</string>
					<key>pfm_note</key>
					<string>Yes, the integer range list DOES NOT include a value of 5</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>4</integer>
						<integer>6</integer>
						<integer>7</integer>
						<integer>8</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>-</string>
						<string>Hide / Show Home Panel</string>
						<string>Toggle Dwell Pause</string>
						<string>Left Click</string>
						<string>Right Click</string>
						<string>Drag and Drop</string>
						<string>Scroll Menu</string>
						<string>Options Menu</string>
					</array>
					<key>pfm_title</key>
					<string>Bottom left corner</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_name</key>
					<string>1</string>
					<key>pfm_note</key>
					<string>Yes, the integer range list DOES NOT include a value of 5</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>4</integer>
						<integer>6</integer>
						<integer>7</integer>
						<integer>8</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>-</string>
						<string>Hide / Show Home Panel</string>
						<string>Toggle Dwell Pause</string>
						<string>Left Click</string>
						<string>Right Click</string>
						<string>Drag and Drop</string>
						<string>Scroll Menu</string>
						<string>Options Menu</string>
					</array>
					<key>pfm_title</key>
					<string>Bottom right corner</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_name</key>
					<string>2</string>
					<key>pfm_note</key>
					<string>Yes, the integer range list DOES NOT include a value of 5</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>4</integer>
						<integer>6</integer>
						<integer>7</integer>
						<integer>8</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>-</string>
						<string>Hide / Show Home Panel</string>
						<string>Toggle Dwell Pause</string>
						<string>Left Click</string>
						<string>Right Click</string>
						<string>Drag and Drop</string>
						<string>Scroll Menu</string>
						<string>Options Menu</string>
					</array>
					<key>pfm_title</key>
					<string>Top left corner</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
				<dict>
					<key>pfm_default</key>
					<integer>1</integer>
					<key>pfm_name</key>
					<string>3</string>
					<key>pfm_note</key>
					<string>Yes, the integer range list DOES NOT include a value of 5</string>
					<key>pfm_range_list</key>
					<array>
						<integer>0</integer>
						<integer>1</integer>
						<integer>2</integer>
						<integer>3</integer>
						<integer>4</integer>
						<integer>6</integer>
						<integer>7</integer>
						<integer>8</integer>
					</array>
					<key>pfm_range_list_titles</key>
					<array>
						<string>-</string>
						<string>Hide / Show Home Panel</string>
						<string>Toggle Dwell Pause</string>
						<string>Left Click</string>
						<string>Right Click</string>
						<string>Drag and Drop</string>
						<string>Scroll Menu</string>
						<string>Options Menu</string>
					</array>
					<key>pfm_title</key>
					<string>Top right corner</string>
					<key>pfm_type</key>
					<string>integer</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Virtual Keyboard Hot Corners</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>dwellHomePanelFollowTriggeredHotCornerEnabled</string>
			<key>pfm_title</key>
			<string>Allow Panel to Follow Triggered Hot Corner</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_KeyboardHardwareOptions</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Sticky Keys</string>
				<string>Slow Keys</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Sticky Keys</key>
				<array>
					<string>stickyKey</string>
					<string>stickyKeyBeepOnModifier</string>
					<string>stickyKeysLocation</string>
					<string>stickyKeyShowWindow</string>
					<string>useStickyKeysShortcutKeys</string>
				</array>
				<key>Slow Keys</key>
				<array>
					<string>slowKey</string>
					<string>slowKeyBeepOn</string>
					<string>slowKeyDelay</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Sticky keys allows modifier keys to be set without having to hold the key down.</string>
			<key>pfm_name</key>
			<string>stickyKey</string>
			<key>pfm_title</key>
			<string>Enable Sticky Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>If enabled, will beep when sticky keys are also enabled.</string>
			<key>pfm_name</key>
			<string>stickyKeyBeepOnModifier</string>
			<key>pfm_title</key>
			<string>Beep when a modifier key is set</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Slow keys adjusts the amount of time between when a key is pressed and when it is activated</string>
			<key>pfm_name</key>
			<string>slowKey</string>
			<key>pfm_title</key>
			<string>Enable Slow Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string>Turn on click key sounds for slow keys</string>
			<key>pfm_name</key>
			<string>slowKeyBeepOn</string>
			<key>pfm_title</key>
			<string>Use click key sounds</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>250</integer>
			<key>pfm_description</key>
			<string>Slow key delay</string>
			<key>pfm_name</key>
			<string>slowKeyDelay</string>
			<key>pfm_range_max</key>
			<integer>500</integer>
			<key>pfm_range_min</key>
			<integer>1</integer>
			<key>pfm_title</key>
			<string>Acceptance delay</string>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_value_unit</key>
			<string>milliseconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>stickyKeyShowWindow</string>
			<key>pfm_title</key>
			<string>Display pressed keys on screen</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>useStickyKeysShortcutKeys</string>
			<key>pfm_title</key>
			<string>Press the Shift key five times to toggle Sticky Keys</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>stickyKeyShowWindow</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_description</key>
			<string>Where to display the pressed sticky keys on screen.</string>
			<key>pfm_name</key>
			<string>stickyKeysLocation</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Top Right</string>
				<string>Top Left</string>
				<string>Bottom Right</string>
				<string>Bottom Left</string>
			</array>
			<key>pfm_title</key>
			<string>Pressed key location on screen</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_SwitchControl</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>Switches</string>
				<string>Navigation</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>switchOnOffKey</string>
					<string>switchHideUIEnabled</string>
					<string>switchHideUITimeout</string>
				</array>
				<key>Switches</key>
				<array>
					<string>switchCoalescePressesDuration</string>
					<string>switchHoldBeforeRepeatDuration</string>
					<string>switchMinimumPressDuration</string>
				</array>
				<key>Navigation</key>
				<array>
					<string>PFC_SegmentedControl_SwitchTiming</string>
					<string>switchAutoScanElementInterval</string>
					<string>switchAutoScanPanelInterval</string>
					<string>switchCursorSize</string>
					<string>switchElementRestartOption</string>
					<string>switchFirstElementDelay</string>
					<string>switchMouseMoveStyle</string>
					<string>switchPlaySounds</string>
					<string>switchResumeAutoScanningAfterSelectEnabled</string>
					<string>switchReverseMouseWhenReachingScreenEdge</string>
					<string>switchScanCycleCount</string>
					<string>switchSpeakSelectedElement</string>
					<string>switchSweepingCursorSpeed</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Switch Control allows the computer to be controlled using one or more switches. These can be mouse, keyboard, gamepad buttons or dedicated devices.</string>
			<key>pfm_name</key>
			<string>switchOnOffKey</string>
			<key>pfm_title</key>
			<string>Enable Switch Control</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchHideUIEnabled</string>
			<key>pfm_title</key>
			<string>Hide Switch Control panel after inactivity</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_conditionals</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_range_list</key>
							<array>
								<true/>
							</array>
							<key>pfm_target</key>
							<string>switchHideUIEnabled</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_default</key>
			<real>15</real>
			<key>pfm_description</key>
			<string>The number of seconds can be entered to the nearest hundreth - ex. 45.45.</string>
			<key>pfm_name</key>
			<string>switchHideUITimeout</string>
			<key>pfm_range_max</key>
			<real>60</real>
			<key>pfm_range_min</key>
			<real>0.25</real>
			<key>pfm_title</key>
			<string>Time of inactivity to hide switch control panel</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_description</key>
			<string>The minimum time required to hold Switch Control.</string>
			<key>pfm_name</key>
			<string>switchMinimumPressDuration</string>
			<key>pfm_range_max</key>
			<real>10</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Hold before perform duration</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_description</key>
			<string>The minimum time required to hold Switch Control. The number of seconds can be entered to the nearest hundreth - ex. 45.45.</string>
			<key>pfm_name</key>
			<string>switchCoalescePressesDuration</string>
			<key>pfm_range_max</key>
			<real>10</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Ignore switch repeats</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>3</real>
			<key>pfm_description</key>
			<string>Time required to hold down the Switch Control key before repeating. The number of seconds can be entered to the nearest hundreth - ex. 45.45.</string>
			<key>pfm_name</key>
			<string>switchHoldBeforeRepeatDuration</string>
			<key>pfm_range_max</key>
			<real>5</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Hold before repeat duration</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable this preference to speak selection while navigating. Set this and switchPlaySounds to both speak selection and play sounds while navigating. Set both to `false` to do nothing while navigating.

switchSpeakSelectedElement = true &amp; switchPlaySounds = false == Speak selection
switchPlaySounds = true &amp; switchSpeakSelectedElement = false == Play sounds
switchSpeakSelectedElement = true &amp; switchPlaySounds = true == Speak &amp; play sounds</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>switchPlaySounds</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>switchSpeakSelectedElement</string>
			<key>pfm_title</key>
			<string>When navigating, speak selection</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>Enable this preference to play sounds while navigating. Enable this and switchSpeakSelectedElement to both speak selection and play sounds while navigating. Set both to `false` to do nothing while navigating.

switchPlaySounds = true &amp; switchSpeakSelectedElement = false == Play sounds
switchSpeakSelectedElement = true &amp; switchPlaySounds = false == Speak selection
switchPlaySounds = true &amp; switchSpeakSelectedElement = true == Speak &amp; play sounds</string>
			<key>pfm_exclude</key>
			<array>
				<dict>
					<key>pfm_target_conditions</key>
					<array>
						<dict>
							<key>pfm_present</key>
							<false/>
							<key>pfm_target</key>
							<string>switchSpeakSelectedElement</string>
						</dict>
					</array>
				</dict>
			</array>
			<key>pfm_name</key>
			<string>switchPlaySounds</string>
			<key>pfm_title</key>
			<string>When navigating, play sounds</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchElementRestartOption</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>After Cursor</string>
				<string>From Start Of Group</string>
				<string>From The Top</string>
			</array>
			<key>pfm_title</key>
			<string>Restart position</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchResumeAutoScanningAfterSelectEnabled</string>
			<key>pfm_range_list</key>
			<array>
				<false/>
				<true/>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do nothing</string>
				<string>Resume</string>
			</array>
			<key>pfm_title</key>
			<string>Auto scanning after select</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchReverseMouseWhenReachingScreenEdge</string>
			<key>pfm_range_list</key>
			<array>
				<false/>
				<true/>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Do nothing</string>
				<string>Bounce back</string>
			</array>
			<key>pfm_title</key>
			<string>When pointer reaches edge</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchCursorSize</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Small</string>
				<string>Medium</string>
				<string>Large</string>
			</array>
			<key>pfm_title</key>
			<string>Switch Control cursor size</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchMouseMoveStyle</string>
			<key>pfm_range_list</key>
			<array>
				<integer>101</integer>
				<integer>102</integer>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Low</string>
				<string>High</string>
			</array>
			<key>pfm_title</key>
			<string>Pointer precision</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>2</integer>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>switchScanCycleCount</string>
			<key>pfm_range_list</key>
			<array>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
				<integer>4</integer>
				<integer>5</integer>
				<integer>6</integer>
				<integer>7</integer>
				<integer>8</integer>
				<integer>9</integer>
				<integer>10</integer>
			</array>
			<key>pfm_title</key>
			<string>Loops</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_SwitchTiming</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Timing</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>Timing</key>
				<array>
					<string>switchAutoScanElementInterval</string>
					<string>switchAutoScanPanelInterval</string>
					<string>switchFirstElementDelay</string>
					<string>switchSweepingCursorSpeed</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>3</real>
			<key>pfm_description</key>
			<string>Values can only be whole numbers.</string>
			<key>pfm_name</key>
			<string>switchSweepingCursorSpeed</string>
			<key>pfm_range_max</key>
			<real>100</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Gliding &amp; rotating cursor speed</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.5</real>
			<key>pfm_description</key>
			<string>Values can be decimals to the nearest hundreth - ex. 5.45</string>
			<key>pfm_name</key>
			<string>switchAutoScanPanelInterval</string>
			<key>pfm_range_max</key>
			<real>25</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Auto scanning interval in panels</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.5</real>
			<key>pfm_description</key>
			<string>Values can be decimals to the nearest hundreth - ex. 5.45</string>
			<key>pfm_name</key>
			<string>switchAutoScanElementInterval</string>
			<key>pfm_range_max</key>
			<real>25</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Auto scanning interval in interface</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<real>0.0</real>
			<key>pfm_description</key>
			<string>Values can be decimals to the nearest hundreth - ex. 5.45</string>
			<key>pfm_name</key>
			<string>switchFirstElementDelay</string>
			<key>pfm_range_max</key>
			<real>10</real>
			<key>pfm_range_min</key>
			<real>0.0</real>
			<key>pfm_title</key>
			<string>Pause on first item</string>
			<key>pfm_type</key>
			<string>float</string>
			<key>pfm_value_unit</key>
			<string>seconds</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Accessibility</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>2</integer>
</dict>
</plist>
