<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Single Sign-On Account settings</string>
	<key>pfm_description_reference</key>
	<string>Use the Single Sign-On payload to define Kerberos account information when accessing servers or specified apps. Single Sign-On is a concept based on Kerberos, where authentication to services running on various servers is granted. This is based on a trust relationship between the servers and the account. Active Directory uses Single Sign-On to authenticate to additional servers that they trust.</string>
	<key>pfm_domain</key>
	<string>com.apple.sso</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>exclusive</string>
	<key>pfm_last_modified</key>
	<date>2019-02-24T11:42:50Z</date>
	<key>pfm_ios_min</key>
	<string>7.0</string>
	<key>pfm_platforms</key>
	<array>
		<string>iOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Single Sign-On Account settings</string>
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Single Sign-On Account</string>
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.sso</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.sso</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable string containing the name of the organization that provided the profile.
The payload organization for a payload need not match the payload organization in the enclosing profile.</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Human-readable name for the account.</string>
			<key>pfm_name</key>
			<string>Name</string>
			<key>pfm_title</key>
			<string>Single Sign-On Account Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_description_reference</key>
			<string>Kerberos-related information.</string>
			<key>pfm_name</key>
			<string>Kerberos</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_description_reference</key>
					<string>Optional. The Kerberos principal name. If not provided, the user is prompted for one during profile installation. This field must be provided for MDM installation.</string>
					<key>pfm_format</key>
					<string>^(.*)@(.*)$</string>
					<key>pfm_name</key>
					<string>PrincipalName</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Kerberos Principal Name</string>
					<key>pfm_type</key>
					<string>string</string>
					<key>pfm_value_placeholder</key>
					<string>auser@SERVER.EXAMPLE.COM</string>
				</dict>
				<dict>
					<key>pfm_description_reference</key>
					<string>The Kerberos realm name. This value should be properly capitalized.</string>
					<key>pfm_name</key>
					<string>Realm</string>
					<key>pfm_require</key>
					<string>always</string>
					<key>pfm_title</key>
					<string>Kerberos Realm</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>The certificate payload used to silently renew a Kerberos ticket. Requires both Single Sign-On payload and identity certificate payload to be in the same profile. The certificate payload must have either the com.apple.security.pkcs12 or com.apple.security.scep payoad type.</string>
					<key>pfm_description_reference</key>
					<string>Optional. The PayloadUUID of an identity certificate payload that can be used to renew the Kerberos credential without user interaction. The certificate payload must have either the com.apple.security.pkcs12 or com.apple.security.scep payload type. Both the Single Sign-On payload and the identity certificate payload must be included in the same configuration profile.</string>
					<key>pfm_name</key>
					<string>PayloadCertificateUUID</string>
					<key>pfm_title</key>
					<string>Renewal Certificate payload</string>
					<key>pfm_type</key>
					<string>string</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>URLs to be used with this account. Any URLs that don't match the pattern won't be contacted. Can use a single wildcard (*) to specify mulilpe matches. Must begin with either http:// or https://</string>
					<key>pfm_description_reference</key>
					<string>List of URLs prefixes that must be matched to use this account for Kerberos authentication over HTTP. Note that the URL postfixes must match as well.

Each entry in the URLPrefixMatches array must contain a URL prefix. Only URLs that begin with one of the strings in this account are allowed to access the Kerberos ticket. URL matching patterns must include the scheme—for example,
http://www.example.com/. If a matching pattern does not end in /, a / is appended to it.

The URL matching patterns must begin with either http:// or https://. A simple string match is performed, so
the URL prefix http://www.example.com/ does not match http://www.example.com:80/. With iOS 9.0 or
later, however, a single wildcard * may be used to specify all matching values. For example, http://*.example.com/ will
match both http://store.example.com/ and http://www.example.com.

The patterns http://.com and https://.com match all HTTP and HTTPS URLs, respectively.</string>
					<key>pfm_name</key>
					<string>URLPrefixMatches</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^(http|https)\:\/\/(.*)$</string>
							<key>pfm_title</key>
							<string>URL Prefix Match</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>URL Prefix Patterns</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
				<dict>
					<key>pfm_description</key>
					<string>List of app identifiers that are allowed to use this login. If this field missing, this login matches all app identifiers. Can use a single wildcard (*) at the end of a string to specify all matching apps (ex. com.mycompany.*)</string>
					<key>pfm_description_reference</key>
					<string>Optional. List of app identifiers that are allowed to use this login. If this field missing, this login matches all app identifiers. This array, if present, may not be empty.

The AppIdentifierMatches array must contain strings that match app bundle IDs. These strings may be exact
matches (com.mycompany.myapp, for example) or may specify a prefix match on the bundle ID by using the * wildcard character. The wildcard character must appear after a period character (.), and may appear only once, at the end of the string (com.mycompany.*, for example). When a wildcard is included, any app whose bundle ID begins
with the prefix is granted access to the account.</string>
					<key>pfm_name</key>
					<string>AppIdentifierMatches</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_format</key>
							<string>^[.\w]+[*]?$</string>
							<key>pfm_title</key>
							<string>App ID</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Specific Apps</string>
					<key>pfm_type</key>
					<string>array</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Kerberos Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Single Sign-On Account</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>
