<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_description</key>
	<string>Finder Settings</string>
	<key>pfm_domain</key>
	<string>com.apple.finder</string>
	<key>pfm_format_version</key>
	<integer>1</integer>
	<key>pfm_interaction</key>
	<string>combined</string>
	<key>pfm_last_modified</key>
	<date>2019-01-23T20:27:52Z</date>
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_default</key>
			<string>Configures Finder settings</string>
			<key>pfm_description</key>
			<string>Description of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>Finder Settings</string>
			<key>pfm_description</key>
			<string>Name of the payload</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.finder</string>
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string>com.apple.finder</string>
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<string></string>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>PFC_SegmentedControl_0</string>
			<key>pfm_range_list_titles</key>
			<array>
				<string>General</string>
				<string>View</string>
				<string>Advanced</string>
			</array>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_segments</key>
			<dict>
				<key>General</key>
				<array>
					<string>FinderSpawnTab</string>
					<string>NewWindowTarget</string>
					<string>ShowExternalHardDrivesOnDesktop</string>
					<string>ShowHardDrivesOnDesktop</string>
					<string>ShowMountedServersOnDesktop</string>
					<string>ShowRemovableMediaOnDesktop</string>
				</array>
				<key>View</key>
				<array>
					<string>ShowPathbar</string>
					<string>ShowPreviewPane</string>
					<string>ShowSidebar</string>
					<string>ShowStatusBar</string>
					<string>ShowTabView</string>
					<string>DesktopViewSettings</string>
				</array>
				<key>Advanced</key>
				<array>
					<string>_FXSortFoldersFirst</string>
					<string>AppleShowAllFiles</string>
					<string>FXDefaultSearchScope</string>
					<string>FXEnableExtensionChangeWarning</string>
					<string>FXEnableRemoveFromICloudDriveWarning</string>
					<string>FXRemoveOldTrashItems</string>
					<string>WarnOnEmptyTrash</string>
				</array>
			</dict>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowHardDrivesOnDesktop</string>
			<key>pfm_title</key>
			<string>Show Hard Disks on the Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowExternalHardDrivesOnDesktop</string>
			<key>pfm_title</key>
			<string>Show External Disks on the Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowRemovableMediaOnDesktop</string>
			<key>pfm_title</key>
			<string>Show CDs, DVDs, and iPods on the Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowMountedServersOnDesktop</string>
			<key>pfm_title</key>
			<string>Show Connected Servers on the Desktop</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>NewWindowTarget</string>
			<key>pfm_range_list</key>
			<array>
				<string>PfHm</string>
				<string>PfCm</string>
				<string>PfVo</string>
				<string>PfDe</string>
				<string>PfDo</string>
				<string>PfAF</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>User Home Folder</string>
				<string>Device</string>
				<string>Hard Drive</string>
				<string>User Desktop</string>
				<string>User Documents</string>
				<string>Recents</string>
			</array>
			<key>pfm_title</key>
			<string>New Finder windows show</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>FinderSpawnTab</string>
			<key>pfm_title</key>
			<string>Open folders in tabs instead of new window</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowTabView</string>
			<key>pfm_title</key>
			<string>Show Tab Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowPathbar</string>
			<key>pfm_title</key>
			<string>Show Path Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowStatusBar</string>
			<key>pfm_title</key>
			<string>Show Status Bar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowSidebar</string>
			<key>pfm_title</key>
			<string>Show Sidebar</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>ShowPreviewPane</string>
			<key>pfm_title</key>
			<string>Show Preview Pane</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>FXEnableExtensionChangeWarning</string>
			<key>pfm_title</key>
			<string>Show warning before changing an extension</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>FXEnableRemoveFromICloudDriveWarning</string>
			<key>pfm_title</key>
			<string>Show warning before removing from iCloud Drive</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_default</key>
			<true/>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>WarnOnEmptyTrash</string>
			<key>pfm_title</key>
			<string>Show warning before emptying trash</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>FXRemoveOldTrashItems</string>
			<key>pfm_title</key>
			<string>Remove items from the Trash after 30 days</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>_FXSortFoldersFirst</string>
			<key>pfm_title</key>
			<string>Keep folders on top when sorting by name</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>FXDefaultSearchScope</string>
			<key>pfm_range_list</key>
			<array>
				<string>SCev</string>
				<string>SCcf</string>
				<string>SCsp</string>
			</array>
			<key>pfm_range_list_titles</key>
			<array>
				<string>Search Entire Mac</string>
				<string>Search the Current Folder</string>
				<string>Use Previous Search Scope</string>
			</array>
			<key>pfm_title</key>
			<string>When performing a search</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>AppleShowAllFiles</string>
			<key>pfm_title</key>
			<string>Show hidden files in Finder</string>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>DesktopViewSettings</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>IconViewSettings</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<real>64</real>
							<key>pfm_name</key>
							<string>iconSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>16</real>
								<real>20</real>
								<real>24</real>
								<real>28</real>
								<real>32</real>
								<real>36</real>
								<real>40</real>
								<real>44</real>
								<real>48</real>
								<real>52</real>
								<real>56</real>
								<real>60</real>
								<real>64</real>
								<real>68</real>
								<real>72</real>
								<real>76</real>
								<real>80</real>
								<real>84</real>
								<real>88</real>
								<real>92</real>
								<real>96</real>
								<real>100</real>
								<real>104</real>
								<real>108</real>
								<real>112</real>
								<real>116</real>
								<real>120</real>
								<real>124</real>
								<real>128</real>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>16x16</string>
								<string>20x20</string>
								<string>24x24</string>
								<string>28x28</string>
								<string>32x32</string>
								<string>36x36</string>
								<string>40x40</string>
								<string>44x44</string>
								<string>48x48</string>
								<string>52x52</string>
								<string>56x56</string>
								<string>60x60</string>
								<string>64x64</string>
								<string>68x68</string>
								<string>72x72</string>
								<string>76x76</string>
								<string>80x80</string>
								<string>84x84</string>
								<string>88x88</string>
								<string>92x92</string>
								<string>96x96</string>
								<string>100x100</string>
								<string>104x104</string>
								<string>108x108</string>
								<string>112x112</string>
								<string>116x116</string>
								<string>120x120</string>
								<string>124x124</string>
								<string>128x128</string>
							</array>
							<key>pfm_title</key>
							<string>Icon size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>54</real>
							<key>pfm_name</key>
							<string>gridSpacing</string>
							<key>pfm_range_max</key>
							<real>100</real>
							<key>pfm_range_min</key>
							<real>1</real>
							<key>pfm_title</key>
							<string>Grid spacing</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>12</real>
							<key>pfm_name</key>
							<string>textSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>10</real>
								<real>11</real>
								<real>12</real>
								<real>13</real>
								<real>14</real>
								<real>15</real>
								<real>16</real>
							</array>
							<key>pfm_title</key>
							<string>Text size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>labelOnBottom</string>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Right</string>
								<string>Bottom</string>
							</array>
							<key>pfm_title</key>
							<string>Label position</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_value_input</key>
							<string>checkbox</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>showItemInfo</string>
							<key>pfm_title</key>
							<string>Show item info</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>showIconPreview</string>
							<key>pfm_title</key>
							<string>Show icon preview</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>arrangeBy</string>
							<key>pfm_range_list</key>
							<array>
								<string>none</string>
								<string>grid</string>
								<string>name</string>
								<string>kind</string>
								<string>dateModified</string>
								<string>dateCreated</string>
								<string>dateLastOpened</string>
								<string>dateAdded</string>
								<string>size</string>
								<string>label</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>None</string>
								<string>Snap to Grid</string>
								<string>Name</string>
								<string>Kind</string>
								<string>Date Modified</string>
								<string>Date Created</string>
								<string>Date Last Opened</string>
								<string>Date Added</string>
								<string>Size</string>
								<string>Tags</string>
							</array>
							<key>pfm_title</key>
							<string>Arrange By</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Desktop Icon View Settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Desktop Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
		<dict>
			<key>pfm_description</key>
			<string></string>
			<key>pfm_name</key>
			<string>StandardViewSettings</string>
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_name</key>
					<string>IconViewSettings</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<real>64</real>
							<key>pfm_name</key>
							<string>iconSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>16</real>
								<real>20</real>
								<real>24</real>
								<real>28</real>
								<real>32</real>
								<real>36</real>
								<real>40</real>
								<real>44</real>
								<real>48</real>
								<real>52</real>
								<real>56</real>
								<real>60</real>
								<real>64</real>
								<real>68</real>
								<real>72</real>
								<real>76</real>
								<real>80</real>
								<real>84</real>
								<real>88</real>
								<real>92</real>
								<real>96</real>
								<real>100</real>
								<real>104</real>
								<real>108</real>
								<real>112</real>
								<real>116</real>
								<real>120</real>
								<real>124</real>
								<real>128</real>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>16x16</string>
								<string>20x20</string>
								<string>24x24</string>
								<string>28x28</string>
								<string>32x32</string>
								<string>36x36</string>
								<string>40x40</string>
								<string>44x44</string>
								<string>48x48</string>
								<string>52x52</string>
								<string>56x56</string>
								<string>60x60</string>
								<string>64x64</string>
								<string>68x68</string>
								<string>72x72</string>
								<string>76x76</string>
								<string>80x80</string>
								<string>84x84</string>
								<string>88x88</string>
								<string>92x92</string>
								<string>96x96</string>
								<string>100x100</string>
								<string>104x104</string>
								<string>108x108</string>
								<string>112x112</string>
								<string>116x116</string>
								<string>120x120</string>
								<string>124x124</string>
								<string>128x128</string>
							</array>
							<key>pfm_title</key>
							<string>Icon size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>54</real>
							<key>pfm_name</key>
							<string>gridSpacing</string>
							<key>pfm_range_max</key>
							<real>100</real>
							<key>pfm_range_min</key>
							<real>1</real>
							<key>pfm_title</key>
							<string>Grid spacing</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>12</real>
							<key>pfm_name</key>
							<string>textSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>10</real>
								<real>11</real>
								<real>12</real>
								<real>13</real>
								<real>14</real>
								<real>15</real>
								<real>16</real>
							</array>
							<key>pfm_title</key>
							<string>Text size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>labelOnBottom</string>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Right</string>
								<string>Bottom</string>
							</array>
							<key>pfm_title</key>
							<string>Label position</string>
							<key>pfm_type</key>
							<string>boolean</string>
							<key>pfm_value_input</key>
							<string>checkbox</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>showItemInfo</string>
							<key>pfm_title</key>
							<string>Show item info</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>showIconPreview</string>
							<key>pfm_title</key>
							<string>Show icon preview</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>arrangeBy</string>
							<key>pfm_range_list</key>
							<array>
								<string>none</string>
								<string>grid</string>
								<string>name</string>
								<string>kind</string>
								<string>dateModified</string>
								<string>dateCreated</string>
								<string>dateLastOpened</string>
								<string>dateAdded</string>
								<string>size</string>
								<string>label</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>None</string>
								<string>Snap to Grid</string>
								<string>Name</string>
								<string>Kind</string>
								<string>Date Modified</string>
								<string>Date Created</string>
								<string>Date Last Opened</string>
								<string>Date Added</string>
								<string>Size</string>
								<string>Tags</string>
							</array>
							<key>pfm_title</key>
							<string>Arrange By</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Standard View Icon View Settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
				<dict>
					<key>pfm_name</key>
					<string>ListViewSettings</string>
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>sortColumn</string>
							<key>pfm_range_list</key>
							<array>
								<string>name</string>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>Name</string>
							</array>
							<key>pfm_title</key>
							<string>Sort column</string>
							<key>pfm_type</key>
							<string>string</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>64</real>
							<key>pfm_name</key>
							<string>iconSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>16</real>
								<real>20</real>
								<real>24</real>
								<real>28</real>
								<real>32</real>
								<real>36</real>
								<real>40</real>
								<real>44</real>
								<real>48</real>
								<real>52</real>
								<real>56</real>
								<real>60</real>
								<real>64</real>
								<real>68</real>
								<real>72</real>
								<real>76</real>
								<real>80</real>
								<real>84</real>
								<real>88</real>
								<real>92</real>
								<real>96</real>
								<real>100</real>
								<real>104</real>
								<real>108</real>
								<real>112</real>
								<real>116</real>
								<real>120</real>
								<real>124</real>
								<real>128</real>
							</array>
							<key>pfm_range_list_titles</key>
							<array>
								<string>16x16</string>
								<string>20x20</string>
								<string>24x24</string>
								<string>28x28</string>
								<string>32x32</string>
								<string>36x36</string>
								<string>40x40</string>
								<string>44x44</string>
								<string>48x48</string>
								<string>52x52</string>
								<string>56x56</string>
								<string>60x60</string>
								<string>64x64</string>
								<string>68x68</string>
								<string>72x72</string>
								<string>76x76</string>
								<string>80x80</string>
								<string>84x84</string>
								<string>88x88</string>
								<string>92x92</string>
								<string>96x96</string>
								<string>100x100</string>
								<string>104x104</string>
								<string>108x108</string>
								<string>112x112</string>
								<string>116x116</string>
								<string>120x120</string>
								<string>124x124</string>
								<string>128x128</string>
							</array>
							<key>pfm_title</key>
							<string>Icon size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<real>12</real>
							<key>pfm_name</key>
							<string>textSize</string>
							<key>pfm_range_list</key>
							<array>
								<real>10</real>
								<real>11</real>
								<real>12</real>
								<real>13</real>
								<real>14</real>
								<real>15</real>
								<real>16</real>
							</array>
							<key>pfm_title</key>
							<string>Text size</string>
							<key>pfm_type</key>
							<string>real</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>showIconPreview</string>
							<key>pfm_title</key>
							<string>Show icon preview</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
						<dict>
							<key>pfm_default</key>
							<true/>
							<key>pfm_name</key>
							<string>useRelativeDates</string>
							<key>pfm_title</key>
							<string>Use relative dates</string>
							<key>pfm_type</key>
							<string>boolean</string>
						</dict>
					</array>
					<key>pfm_title</key>
					<string>Standard View List View Settings</string>
					<key>pfm_type</key>
					<string>dictionary</string>
				</dict>
			</array>
			<key>pfm_title</key>
			<string>Standard View Settings</string>
			<key>pfm_type</key>
			<string>dictionary</string>
		</dict>
	</array>
	<key>pfm_targets</key>
	<array>
		<string>user</string>
		<string>system</string>
	</array>
	<key>pfm_title</key>
	<string>Finder</string>
	<key>pfm_unique</key>
	<true/>
	<key>pfm_version</key>
	<integer>1</integer>
</dict>
</plist>